{"business": {"job_title": {"1270": "Forestry Technician- Timber Sales Prep", "1192": "MISSION TRANSACTION UNIT INTERN", "1459": "Environmental Scientist"}, "full_job_description": {"1270": "United States Forest Service - Resource Assistants ProgramChippewa National Forestry Technician, Timber Sale PrepOrganization:  Chippewa National ForestPartner Organization(s):  The Corps NetworkLocation:  Walker, MNTerm of Service:  7 monthsWage:  $500 per weekStart Date:  March 2022United States Forest Service Resource Assistants Program (RAP) is a rigorous and immersive, paid internship for individuals interested in Forest Service careers. Resource assistants work under the supervision of Forest Service staff to complete mission-critical work that demonstrates leadership, critical thinking, and strategic communication. Through collaboration, training, and mentorship, resource assistants gain the tools to launch their natural and cultural resource careers.RAP seeks to engage highly motivated candidates through these program objectives:Instill stewardship values in the next generation of natural and cultural resource management professionals;Expand and enhance the capacity of the Forest Service to accomplish mission-critical work and high-priority projects;Attract and retain a diverse and inclusive workforce to support the Forest Service’s mission to “sustain the Nation’s forests and grasslands to meet the needs of present and future generations.”Position Description: The Timber Sale Prep Forestry Technician will perform presale duties including timber cruising and timber marking.Position Duties and Responsibilities: The Timber Presale Forestry Technician Intern will:Independently apply silvicultural prescriptions and marking guides to designate harvest timber.Bring to the attention of responsible individuals, situations on the ground that are inconsistent with guidelines.Observe and report areas of possible archeological significance, and sightings of sensitive, threatened, or endangered wildlife species.Traverses harvest unit boundaries, road locations, and determines area.Participates in other aspects of resource management support work such as recreation, maintenance, silviculture, tree planting, etc.Education and Qualifications: Intern should possess the following educational and experiential qualifications:Working knowledge of forest practices and techniques, including application of silvicultural prescriptions, aerial photographs, maps, environmental analysis reports, and like guides to independently select harvest timber in a variety of stand conditions.Knowledge of timber cruising commensurate with \"Qualified Timber Cruiser\". Including a working knowledge of measuring tree diameters and heights, map reading, compass use, tree species identification, obvious defect recognition and determination, traversing, and the use of tools associated with timber cruising. Familiar with various standard cruise methods and sampling techniques.Knowledge of regularly used timber cruise computer programs including data collection, processing, and the interpretation of output reports.Knowledge of other resource areas, such as wildlife management or archeology to recognize situations that require specific protection measures.Driver’s License Required.Work Environment and Physical Demands The work is performed primarily in a field environment. Field work often requires moderate to strenuous physical exertion, including walking, bending, and climbing, in rugged terrain under adverse conditions for long periods of time. Work in the forest environment involves considerable risk of falls due to uneven terrain, risk of insect bites, contact with poisonous plants, etc. Work is conducted during conditions such as rain, snow, wind, dust, extreme heat and extreme cold. Hardhat, boots, gloves, and possibly other safety equipment are requiredDuration: 7 months: March - October 2022Location: Chippewa National ForestWalker, MNCompensation and Benefits: $500/weekHealth insurance benefitsHousing allowanceGenerous professional development allowanceOpportunities for paid work travel, training sessions, and conferences.Opportunities to network with U.S. Forest Service field staff and professionals.RAP Direct Hire and Noncompetitive Hiring Authority: After completing and meeting program requirements, interns may become eligible for the RAP direct hire and noncompetitive hiring authority through a 2-year certificate of eligibility.How to Apply: Please submit a resume, cover letter, and references to apply.For questions regarding this Resource Assistant Program Internship, please contact The Corps Network.Partner Organizations: About The Corps Network: The Corps Network is the National Association of Service and Conservation Corps. Our 130+ Corps provide young adults and veterans the opportunity to serve our country through projects on public lands and in rural and urban communities. The Corps Network supports Corps by advocating on their behalf, providing access to funding and project opportunities, and by offering expertise in Corps operations and programming.Job Types: Full-time, InternshipPay: $500.00 per weekBenefits:Health insuranceProfessional development assistanceRelocation assistanceSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Cass Lake, MN: Reliably commute or planning to relocate before starting work (Preferred)Education:Associate (Preferred)License/Certification:Driver's License (Required)Work Location: One location", "1192": "Interns serve as junior financial analysts and may be involved in all stages of project development and relationship management as part of a project team. Interns also work on tasks in any stage of the origination, relationship management, and compliance process for three to six transactions, depending on the number of transactions that a project team is involved in. Additional duties include: Reviewing applications for financing and financial statements; Building or analyzing models of projected project cash flows; Researching various policy issues; Preparing country economic and political risk analyses; Preparing credit reviews of outstanding loans; Collaborating with Investment Officers to present the proposed loan to an approval committee; Working with members of other departments to receive required policy clearances; and Working with a project team to construct term sheets, participate in negotiations on loan agreement terms, or assist in the processing of disbursement requests.", "1459": "For employment and internship opportunities, please submit your resume, cover letter and compensation requirements to:\n\nTNT Environmental, Inc.\nAttn: Human Resources\n4455 Brookfield Corporate Drive\nSuite 100\nChantilly, Virginia 20151\n\nEmail: Info@TNTenvironmentalinc.com\nPhone: 703-466-5123\nTNT is seeking an Environmental Scientist with 3-5 years of relevant experience for its Chantilly, Virginia office. Qualified candidates should have a degree in Biology, Ecology, Botany, or Environmental Science, well developed written and oral communication skills and a desire to work in a team-oriented environment. The position will entail a mixture of office and field work in all seasons of the year.\n\nThe primary responsibilities of the position are to conduct and manage routine to complex wetland and natural resource projects, work closely with a team of wetland and natural resource professionals and business development. Fundamental and working knowledge of local, state and federal regulatory regulations and processes in Virginia, Maryland, DC and West Virginia is critical."}, "company_name": {"1270": "US Forest Service", "1192": "Development Finance Corporation (formerly Overseas Private Investment Corporation)", "1459": "TNT Environmental"}, "company_location": {"1270": "Cass Lake, MN", "1192": "Washington, DC", "1459": "Chantilly, VA"}, "source": {"1270": "indeed", "1192": "usa_jobs", "1459": "indeed"}, "job_link": {"1270": "https://www.indeed.com/company/United-States-Forest-Service/jobs/Forestry-Technician-67db5cddf010a13d?fccid=421e1914938b668b&vjs=3", "1192": "https://www.usajobs.gov:443/GetJob/ViewDetails/598822200", "1459": "https://www.indeed.com/rc/clk?jk=d77583df76ada449&fccid=24f6562f4e7b82ea&vjs=3"}}, "science": {"job_title": {"1256": "Environmental Education Member at John Heinz National Wildlife Refuge", "1455": "Resource Management Field Technician/Educational Outreach Specialist", "586": "USFS Modeling Fire Resistance Management: Oregon", "158": "National Marine Life Center Marine Animal Rehabilitation and Environmental Education Internship, Massachusetts", "1459": "Environmental Scientist"}, "full_job_description": {"1256": "ACE EPIC placements provide young adults with focused, hands-on opportunities to work alongside and under the guidance of agency mentors as they apply their knowledge of resource management on their path to becoming the next generation of resource and land managers.\nFunding for ACE positions is provided by a federal program designed specifically for the employment of youth and young adults.\nFor more information about ACE, please visit: www.usaconservation.org.\nSummary: American Conservation Experience, a nonprofit Conservation Corps, in partnership with John Heinz National Wildlife Refuge at Tinicum, is seeking 1 member to work directly with Refuge staff and assist with the Environmental Education program.\nIndividuals interested in this position will experience first-hand the delicate balance of managing both wildlife and people. A great staff will be available to assist your endeavors both at work and play. Come help us make history as we embark into a new definition of environmental education! This opportunity is intended for an enthusiastic individual with strong interest in gaining a robust experience in the field of environmental education.\nStart Date: March 2022 or ASAP\nEnd Date: 16 weeks after start date\nLocation: Philadelphia, PA\nJohn Heinz National Wildlife Refuge at Tinicum is America's First Urban National Wildlife Refuge and is in the center of it all. Located in historic Philadelphia and Delaware Counties, this urban refuge is a great place to start your career. John Heinz National Wildlife Refuge at Tinicum protects approximately 1,000 acres of diverse habitat that supports over 300 species of birds and countless other species on the doorstep of Philadelphia, one of the largest metropolitan cities on the east coast. The refuge provides unique opportunities for visitors to escape from the hustle and bustle of the city into nature for relaxation.\nFor more information about USFWS John Heinz National Wildlife Refuge at Tinicum please visit: https://www.fws.gov/refuge/john_heinz/\nWork Schedule: Duties will primarily be carried out Monday - Friday, with some adjusted time for evening or weekend events. Bi-weekly totals should not exceed 80 hours.\nLiving Allowance: ACE member is expected to contribute approximately 40 hours/week and will receive a living allowance of $600/week to cover the costs of food and incidental expenses, dispersed bi-weekly.\nHousing: ACE members will be accommodated in provided agency housing at no cost for the duration of the term. When residing in FWS provided-housing or on FWS lands, strict adherence to site specific policies and/or regulations is required.\nPublic Land Corps (PLC) Non-competitive Hiring Authority: Members serving on this project may be eligible to receive a Department of the Interior (DOI) PLC non-competitive hiring authority certificate upon completion of their term of service. Eligible members must meet standard requirements of completing at least 640 hours (16 weeks at 40 hours/week) and utilize their certificate when applying for qualifying federal positions within 2 years of receipt. More information can be provided upon request.\nPosition Description: The Environmental Education Specialist will assist the refuge in the following activities: prepare and present on-and off-site environmental education programs for a variety of audiences, develop and present interpretive programs like orientations and guided hikes for public audiences or school groups, learn to teach youth outdoor skills like fishing, archery, and kayaking, use verbal and written communication to engage the local community, develop or revise environmental education and interpretive materials, brochures, web content, exhibits and signs, draft a variety of written materials including news releases, articles, correspondence and event flyers, and assist in operation of a visitor center. These experiential learning opportunities will be hands-on, engaging, and culturally relevant and will utilize resources in the local community and environment. The position is responsible for supporting the implementation of curriculum through presenting programs, fostering partnerships, assisting in the planning of logistics, co-teaching and leading.\nThis position will require the successful applicant to develop and present environmental education programs both on the refuge and in classrooms, focusing attention on urban ecology & wildlife and the connections that exist between people and wildlife. Environmental education programs are aligned to the Pennsylvania Department of Education's Standards Aligned System for audiences in Kindergarten through 8th grade, primary audiences will be 4th grade students. Candidates should expect to work closely with communities that environmental organizations have failed to previously engage and represent. In addition to engaging students from local schools in repeated programming, candidates should also expect to work within the local Southwest Philadelphia Community to engage and build trust with community members and leaders alike. Candidates will engage directly with audiences of all ages and backgrounds and work alongside a diverse team of staff and dedicated volunteers.\nRefuge staff will provide ample training and development opportunities both internally and externally to support the selected candidate. Local candidates are strongly encouraged to apply though all applications will be considered. Selected applicants should have strong communication skills, work well in a collaborative team setting, and have the ability to accept feedback gracefully and integrate it. This position requires work on occasional evenings and may include a shifted schedule to cover a weekend day.\nPhysical Requirements: This position requires physical exertion such as walking moderate distances (0.5 - 1.5 miles) over uneven, wet, or gravel surfaces; bending, crouching, stooping, lifting or reaching. Hand and finger dexterity and physical coordination may involve fine and precise procedures, delicate adjustments or exact measurements.\nEnvironmental Conditions/Hazards: The candidate may encounter environmental conditions/hazards including extreme heat or cold, wetland/marsh habitat, open water, biting insects, poisonous plants, and sun exposure. The member is expected to conduct duties in a safe and orderly manner so as not to endanger self, fellow staff/members or resources.\nEquipment Use/Safety: Any tools or equipment required for the accomplishment of the duties will be provided by the FWS. Use of personal protective equipment (PPE), typically provided by the FWS, will be mandatory for any activity that requires it. Strict adherence to FWS and ACE equipment training, certification and safety protocols is required.\nQualifications: Applicants for the position must hold or be pursuing a minimum of an associate's degree and/or have relevant experience in subject areas such as Education, Childcare, Environmental Studies, or Biology.\nRequired:\nWilling and able to represent ACE and the partner organization in a professional, positive, and enthusiastic manner.\nU.S. Citizen or Permanent Resident\nMust be 18-35 years of age (Interns must be 21-35 to apply for any ACE position that requires or anticipates operation of agency or ACE vehicles for duties.)\nA valid driver's license and a clean driving record are required (documentation to be provided upon request)\nAbility to work in varied outdoor conditions with occasional challenging activity in support of environmental education. This may include: being outdoors on hot or rainy days, leading hikes of ½ mile to 1 ½ mile distance, and lifting, storing, and transporting kayaks and archery equipment.\nAbility to work alone and in a group\nAbility to speak and write in English\nAbility to undergo a federal criminal background check is required\nWearing a clearly visible ACE-EPIC uniform component is required at all times\nPreferred:\nA strong desire to learn and improve verbal and written communication skills to best engage diverse audiences\nCandidate from the Greater Philadelphia area\nDual language speakers\nTo Apply: Please submit your resume, unofficial academic transcripts, and contact information for three professional/academic references to the online application page for this position here: https://usaconservation.applicantpool.com/jobs/. A cover letter demonstrating your interest and experience is optional.\nNOTE: Early consideration will be given as applications are received. This position may close at any time. If you have any questions regarding this position please feel free to contact ACE EPIC USFWS Division Support Specialist, Claire Barnwell, cbarnwell@usaconservation.org, (585) 484-7626.\nVaccination Requirement: ACE Members must verify that they are fully vaccinated for Covid-19 or have requested and been granted a medical or religious exemption to vaccination by the time they start their term.\nEEO: American Conservation Experience provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, American Conservation Experience complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.", "1455": "Expected Dates\nJune 13, 2022 to October 2, 2022\nSite\nDevils Postpile National Monument\nPosition ID\nPO-00732121\n\nInterns will work with both the visitor services and resource management teams at Devils Postpile National Monument. Primary duties include working in the monument’s Ranger Station and presenting interpretive programs, developing table talks, and providing information to the many visitors to the monument. In addition, interns will participate in natural resource monitoring and incorporate this knowledge and experience into their programs. Natural resource management projects may include: water quality and quantity monitoring, air quality monitoring, invasive plant species survey and treatment (and mapping with GPS), relocating and downloading temperature sensors from 100 sites as part of a “Cold Air Pooling” study, habitat mapping and condition assessments, and retaking long term photo points. Interns will assist in data collection and management, and learn about natural resource management issues. The intern will also work on expanding the volunteer program at the monument focusing on a volunteer “Paw Patrol” and invasive plant survey and treatment. Interns will lead volunteers, develop innovative ways to recruit volunteers and help to improve and expand the monument’s volunteer in parks program.\n\nEach intern will receive at least two weeks of training at the beginning of their internship. This training will include natural and cultural resources knowledge, interpretation skills, climate change communication, the National Park Service mission, Operational Leadership, risk management, and safety. Throughout the season, there may be opportunities for training including visiting nearby NPS, Forest Service, and BLM sites. If interested, the intern may be called upon to contribute to other emerging needs including being a team member in a litter carryout or searcher for a visitor in need of assistance.\n\nPlease have a resume attached to your SCA application.\n\nLocation Description\nSite Description: Devils Postpile National Monument is 800 acres of granite domes, rivers, streams, and waterfalls. This stunning geologic formation for which the monument was named is nestled in the Ansel Adams Wilderness, just minutes from Mammoth Lakes, CA. Recreational opportunities in the area are endless, ranging from hiking and climbing to mountaineering and skiing.\nTraining Provided\nInvasive plant identification, survey, and treatment; stream discharge measurements; water quality; GPS navigation; field data collection methods; downloading data loggers; data management; interpretation; citizen science outreach; program development;\nEducational/Recreational Opportunities\nNatural and cultural history of Devils Postpile National Monument, interpretation and education, hiking,\nHandicap Accessible?\nNo\nMain Area of Focus\nNatural Resources Mgmt\nEducation, Training & Skills Expected\nBiology\nsome coursework or experience\nEarth Sciences\nsome coursework or experience\nResource Management\nsome coursework or experience\nCustomer Service\nsome experience\nData Entry\nsome experience\nField Research\nsome experience\nGPS\nsome experience\nPublic Speaking\nsome experience\nFurther Details\nAmeriCorps Eligible\nEligible\nDriving Logistics\nValid Drivers License Needed\nHousing or Stipend Provided?\nYes\nHousing consists of apartments in the town of Mammoth Lakes, CA with semi-private sleeping areas (rooms with dividers for individual privacy). Living spaces are shared, with each apartment having a kitchen, dining room, and living room. Housing units are fully furnished and are within walking or biking distance from most amenities. Housing is located 30 minutes from the duty station. Transportation to and from work will be provided. Housing is provided to SCA by Mammoth Mountain Ski Area.\nIndoor/Outdoor\nOutdoor\nUS Citizenship\nRequired", "586": "*Applications may be reviewed on a rolling-basis.\n\nUSFS Office/Lab and Location: A research opportunity is available at the USDA Forest Service, Pacific Northwest Research Station Located in Portland, Oregon.\n\nAt the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.\n\nThe mission of the Forest Service's Pacific Northwest Research Station is to generate and communicate impartial knowledge to help people understand and make informed choices about natural resource management and sustainability. Consistent with this mission and with guidance from the mentor, the participant will enjoy opportunities to (1) continue their professional development while addressing policy relevant questions at a pivotal moment, as changes in climate and fire are becoming increasingly apparent in west coast forests, (2) inform and contribute to decisions about managing forest ecosystems, (3) gain understanding of how management objectives, practices and opportunities differ, but may complement one another, across ownerships, and (4) pursue research related to fire resistance and resilience, forest carbon dynamics and policies with potential to increase realization of landowner and societal objectives.\n\nResearch Project: Public, corporate and non-corporate ownerships in the Pacific Northwest’s multi-owner forest landscapes west of the Cascade crest implement disparate approaches to forest management. A collection of largely stand replacing megafires in western Oregon and southwest Washington in 2020 impacted about a million forested acres and dramatically underscored the ecological and economic importance of low frequency, stand replacing fire in this region. To what extent do current management practices on each ownership enhance resistance to wildfire and deliver climate benefits via carbon sequestration and storage? What silvicultural alternatives might more effectively deliver these benefits, and what tradeoffs would they imply, particularly with respect to the economic feasibility of managing these lands?  This modeling component of the PNW Research Station’s Westside Fire Research Initiative study of Strategic Fuels Management addresses these questions by leveraging the statistically representative sample of all forests provided by the Forest Inventory and Analysis network of 7000+ forest inventory plots in this region and the BioSum modeling framework and its Forest Vegetation Simulator stand projection model to simulate management outcomes over decades. Building on information generated by research collaborators in this study who are interviewing and surveying landowners to understand current forest objectives and management, and if/how they address fire and carbon, mentor and participant will collaborate to model management effectiveness and feasibility from multiple perspectives on each FIA plot under multiple management scenarios, over time. Summarizing this data across a very large number of forest plots that represent virtually all extent forest conditions, will help us recognize and position us to recommend owner- and stand-specific opportunities for reducing fire hazard and enhancing the delivery of climate benefits.   \n\nLearning Objectives: Learning objectives for the project include advancing the participant's exposure to policy relevant, hypothesis based research and technology development centered on the management of forests and natural resources. They will enhance their capabilities for formulating practical research questions and designing research that promotes understanding of how management can be modified to enhance fire resistance; the compatibility of fuels management with carbon sequestration and other forest goals that vary among landowners; and the complex interplay among goal accomplishment, stand replacing fire incidence, and the effects of climate change. Participant will also gain experience with analyzing and modeling inventory data, implementing silvicultural prescriptions in a stand projection model, and sharing information developed through this analysis with a cadre of co-producers and clients engaged with this project as well as larger management, professional and scientific communities via presentations and publication of findings in journals, reports and electronically delivered visualizations. \n\nMentor(s): The mentor for this opportunity is Jeremy Fried (orise@pnwfia.info). If you have questions about the nature of the research please contact the mentor(s).\n\nAnticipated Appointment Start Date: June 15, 2021.  Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of USFS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full-time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience, ranging from $55,000-$70,000 per year.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens and Lawful Permanent Residents (LPR) only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS. Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process please email USForestService@orise.orau.gov and include the reference code for this opportunity.", "158": "Animal Care Responsibilities: Depending on need and case load, interns will assist with the care of the NMLC rehabilitation patients including seals, sea turtles, and a variety of native turtle species. Animal Care duties will include animal restraint; cleaning; disinfecting tanks, equipment, and environmental enrichment devices; diet preparation; administering feeds (including tube feeding); record keeping; facility maintenance; and water quality testing. Interns will also assist animal care staff with medical procedures, admission exams, animal necropsies, and release events.\nEducation Responsibilities: Interns will assist with environmental education programs, including on-site programs, off-site programs, virtual programs, fairs, and festivals. Programs will focus on marine animals, rehabilitation practices, conservation, and STEM activities. Interns will learn how to effectively interpret and educate guests of NMLC on marine animals and conservation. Interns may be asked to work in the gift shop and assist with various office projects such as fundraising and data entry. Opportunities may be available to create displays for the Discovery Center and help create lesson plans and activities that are aligned with the Massachusetts State Frameworks and Ocean Literacy Principles. \nOther Responsibilities:  Each intern is assigned to multiple projects in different areas of the organization, e.g. research, fundraising, rehabilitation, marketing, social media or education. A weekly chore will be delegated to each intern to assist with the upkeep of the facility and equipment. Each intern is required to attend regularly scheduled meetings throughout their time at NMLC. At the end of the internship, the intern will deliver a presentation about their experience and projects to staff and volunteers.", "1459": "For employment and internship opportunities, please submit your resume, cover letter and compensation requirements to:\n\nTNT Environmental, Inc.\nAttn: Human Resources\n4455 Brookfield Corporate Drive\nSuite 100\nChantilly, Virginia 20151\n\nEmail: Info@TNTenvironmentalinc.com\nPhone: 703-466-5123\nTNT is seeking an Environmental Scientist with 3-5 years of relevant experience for its Chantilly, Virginia office. Qualified candidates should have a degree in Biology, Ecology, Botany, or Environmental Science, well developed written and oral communication skills and a desire to work in a team-oriented environment. The position will entail a mixture of office and field work in all seasons of the year.\n\nThe primary responsibilities of the position are to conduct and manage routine to complex wetland and natural resource projects, work closely with a team of wetland and natural resource professionals and business development. Fundamental and working knowledge of local, state and federal regulatory regulations and processes in Virginia, Maryland, DC and West Virginia is critical."}, "company_name": {"1256": "American Conservation Experience - EPIC", "1455": "Student Conservation Association", "586": "U.S. Department of Agriculture (USDA)", "158": "National Marine Life Center", "1459": "TNT Environmental"}, "company_location": {"1256": "Philadelphia, PA", "1455": "Mammoth Lakes, CA", "586": "Portland, OR", "158": "Buzzards Bay, MA", "1459": "Chantilly, VA"}, "source": {"1256": "indeed", "1455": "indeed", "586": "tamu", "158": "tamu", "1459": "indeed"}, "job_link": {"1256": "https://www.indeed.com/rc/clk?jk=4454c0b8548dcf4a&fccid=cb79339fb9178ce7&vjs=3", "1455": "https://www.indeed.com/rc/clk?jk=ca84aa89d280f5de&fccid=747c2654faa6f788&vjs=3", "586": "https://wfscjobs.tamu.edu/jobs/usfs-modeling-fire-resistance-management-oregon/", "158": "https://wfscjobs.tamu.edu/jobs/national-marine-life-center-marine-animal-rehabilitation-and-environmental-education-internship-massachusetts/", "1459": "https://www.indeed.com/rc/clk?jk=d77583df76ada449&fccid=24f6562f4e7b82ea&vjs=3"}}, "engineering": {"job_title": {"1716": "Environmental and Wildlife Health", "1357": "Research Scientist", "553": " Riparian Monitoring Members – Save Our Bosque Task Force, NM – AmeriCorps Eligible", "1316": "Research Kinesiologist/Engineer: Injury Biomechanics-- Musculoskeletal Injury Prevention and Protect", "1459": "Environmental Scientist"}, "full_job_description": {"1716": "Organization\nU.S. Department of Energy (DOE)\nReference Code\nDOE-MSIPP-22-2-LANL\nHow to Apply\nCompletion of all required fields in the application and successful application submission\nUndergraduate or graduate transcripts as appropriate\nTwo recommendations\n\nIf you have questions, send an email at MSIPPInternships@orau.org. Please include the reference code for this opportunity in your email.\nFor Technical information, contact Jeanne Fair or jmfair@lanl.gov.\nCertification:\nI certify that I am at least 18 years of age and a US citizen, and am currently enrolled as a student in a degree seeking undergraduate or graduate program in a STEM field at an accredited Minority Serving Institution (MSI).\nApplication Deadline\n3/11/2022 11:59:59 PM Eastern Time Zone\nDescription\nThe Minority Serving Institutions Partnership Program (MSIPP) Internships is a new program to promote the education and development of the next generation workforce in critical science, engineering, technology, and math (STEM) related disciplines that complement current and future missions of DOE national laboratories. The MSIPP Internship program is designed to provide an enhanced training environment for next generation scientists and engineers by exposing them to research challenges unique to our industry.\nMSIPP Interns will be given the opportunity to complete Summer Internships aligned with ongoing U.S. Department of Energy Office of Environmental Management (DOE-EM) research under the direction of a host national laboratory. The internship will be performed at the host national laboratory, utilizing their facilities and equipment under the guidance of a research staff member.\nMinority Serving Institutions are institutions of higher education enrolling populations with significant percentages of undergraduate minority students.\nProject: This project will use a long-term dataset on wild bird health and condition with respect to climate pressures and environmental conditions. We will use statistical models to estimate correlations between changes in abiotic and biotic factors related to climate and wildlife health. We will then adapt mechanistic disease and population dynamics models to our system, informing parameters with the statistical analysis, allowing for prediction of system states under future climate regimes and novel fusion of mechanistic and statistical models that leverages strengths of both approaches. This project will also analyze genomic data from the microbiome of wildlife species and investigate new approaches to the analysis and application for wildlife and environmental health. Long-term datasets will be available to be analyzed as part of this project and there may be the opportunity for field work.\nSalary: Selected candidate will be compensated by either a stipend or salary, and may include one round trip domestic travel to and from the host laboratory. Stipends and salaries will be commensurate with cost of living at the location of the host laboratory. Housing information will be provided to interns prior to arrival at the host laboratory, and will vary from lab to lab.\nQualifications\nEligible applicants must:\nBe a citizen of the United States.\nBe at least 18 years of age.\nCurrently enrolled as a full-time undergraduate or graduate student at an accredited Minority Serving Institution, https://orise.orau.gov/msipp/documents/approved-msi-school-list.pdf.\nWorking toward a science, technology, engineering, or mathematics (STEM) degree.\nHave an undergraduate or graduate cumulative minimum Grade Point Average (GPA) of 3.0 on a 4.0 scale, and\nPass a drug test upon selection to participate in the MSIPP *The process and timing for drug testing varies from lab to lab. Use of Marijuana/Cannabis or its derivatives if prescribed is legal in some states. However, having these drugs in your system is NOT legal at United States Federal Contractor sites and National Laboratories.\n\nRequired Knowledge, Skills, Work Experience, and Education\nSuccessful candidates will:\nHave ability to follow all laboratory safety rules and procedures.\nSome experience with R programming (not mandatory). Familiarly with statistics and basic genetics. Background or courses in microbiology, genetics, or bioinformatics. Significant scientific writing.\n\nDesired Knowledge, Skills, Work Experience, and Education\nIt is desirable for the candidate to have:\nSome experience with R programming (not mandatory). Familiarly with statistics and basic genetics. Background or courses in microbiology, genetics, or bioinformatics. Significant scientific writing.\n\nEligibility Requirements\nCitizenship: U.S. Citizen Only\nDegree: Currently pursuing a Bachelor's Degree or Master's Degree.\nOverall GPA: 3.00\nDiscipline(s):\nComputer, Information, and Data Sciences\nEarth and Geosciences\nEnvironmental and Marine Sciences\nLife Health and Medical Sciences\nMathematics and Statistics\nAffirmation\nCertification:\nI certify that I am at least 18 years of age, a US citizen, and currently enrolled as a student in a degree seeking undergraduate or graduate STEM field program at an accredited Minority Serving Institution (MSI).", "1357": "EMDO LaboratoryJob Opening 2021Title: Research Scientist / Remote sensing in Atmosphere & Ecological scienceLocation: Laurel, Maryland, USA.Type:  Full-time positionSalary range: Negotiable based on candidate’s overall competence.Term: One year appointment with the possibility of renewal contingent on satisfactory job performance.This position will be posted until a sufficient number of applications have been received.Thereafter, applications will be reviewed on an as-needed basis.Relocation: No relocation package is offered for this position.Work Authorization: EMDO will sponsor H1 petition for newly graduated PHD Students to fill this position.US citizen, Green card holder, Valid foreign national legal resident in U.S are welcome.About EMDO laboratory: Located in Laurel, Maryland, USA. Environmental Model & Data Optima (EMDO) is an advanced research laboratory established in 2017, mainly engaged in atmosphere & ecological sciences by facilitating remote sensing data application and offering high quality consulting services.Our positive and fast-paced environment is powered by a highly skilled interdisciplinary team committed to improving efficiency of extreme events monitoring and smart prediction for sustainable social economic development.EMDO laboratory is supported through the international collaborations and the joint research with industries and academic institutes in the United States.Job Overview: The position is seeking individuals with Atmosphere or terrestrial expertise in machine and deep learning, algorithm development, or Big Data software engineering. Ideal candidate is expected to be highly creative, have strong numerical and critical skills to initiate applied research and develop advanced application.14900 Sweitzer Ln, Suite 106Laurel, Maryland, 20707 www.emdous.comEMDO LaboratoryApplied studies in ecosystem science:/Vegetation Monitoring / Evapotranspiration / Carbon Cycling & Emission/ Corp Yield Estimation / Corp Grow Monitoring / Disaster Monitoring & Assessment(Drought/ Flood/ Fire / Snow/ Insects /…) /…Applied studies in atmosphere science:/Greenhouse gases / Severe Weather Monitoring & Assessment /Radiative transfer model/ Air Quality Monitoring & Simulation /…This position offers an excellent environment for working with a highly skilled interdisciplinary team and will provide chances to collaborate with researches at both national and international institutes.Preferred Qualifications: PhD in atmospheric science, ecology, physical geography, earth science, plant physiology, environmental science or related disciplines (preferable more than 3 years postdoctoral experience)Evidence of ability to publish results in relevant journalsStrong software development and/or algorithmic scripting skills, preferably with knowledge of machine learning and/or deep learning frameworks.Skill in using Unix and Linux computing environmentsSkill in programming (C/C++, Java, Fortran90 or later preferred) and scripting languages (Unix/Linux shell scripts, Python, etc.)Skill in remote sensing. Proven experience in processing satellite data (particularlyLandsat, MODIS and Sentinel-2) is an advantageAbility to set research direction independently or with senior scientists, and to quickly alter the research path when appropriate.Ability to apply independent decision-making and initiative within the scope of assigned tasks, with self-directed development of work goals.Skill in communicating effectively in English with scientists of diverse backgrounds, software engineers, and project funding agencies on technical details.Skill in presenting scientific results in both oral and written form.Responsibilities: Works with EMDO scientists and engineers for the purpose of leading efforts to remote sensing of environmental parameters from remote sensing data to support project and sponsor needs. This work will include:Develop the prototype of software to explore the remote sensing dataset and construct algorithms that can learn from and make predictions on data.14900 Sweitzer Ln, Suite 106Laurel, Maryland, 20707 www.emdous.comEMDO LaboratoryAdapt research done in academia and industry to our sponsors’ uniquely challenging data sources and problems sets.Code in C/C++, Fortran, Python, or other languages for prototyping/testing algorithms and software tools in a team environment.Conduct quantitative data analysis using a variety of datasets to identify, monitor, and explore operations.Design and develop retrieval, processing, fusion, analysis, and visualization of various datasets. In addition, the individual will be leveraging backend/frontend software and utilizing/integrating various data platforms to support rapid analytics including the use of data visualization tools.Publishes in peer-reviewed technical journals and presents results at technical meetings and conferences. Prepares summary reports as needed.Assists in managing projects, interacting with sponsors as needed, and developing and applying innovative methods for the primary work areas described above.What’s in It for You: CompensationPTOPaid HolidaysBenefits (Medical, Dental, Vision)Retirement PlanAnd more!EEO/AAP Statement: Environmental Model & Data Optima Inc. (EMDO Laboratory) is an equal opportunity/equal access/affirmative action employer that strives to develop and maintain a diverse workforce. EMDO is committed to providing equal opportunity for all employees and applicants for employment and does not discriminate on the basis of race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, or pregnancy.Whatever your intersection of identities, you are welcome at the EMDO Laboratory. We are committed to inclusivity and promoting an equitable environment that values and respects the uniqueness of all members of our organization.EMDO laboratory14900 Sweitzer Ln, Suite 106Laurel, Maryland, 20707 www.emdous.comJob Types: Full-time, Contract, InternshipPay: $50,000.00 - $150,000.00 per yearBenefits:401(k) matchingDental insuranceFlexible scheduleHealth insuranceHealth savings accountRetirement planVision insuranceSchedule:Monday to FridayAbility to commute/relocate:Laurel, MD 20707: Reliably commute or planning to relocate before starting work (Preferred)Education:Doctorate (Preferred)Experience:Remote sensing: 3 years (Preferred)PYTHON: 2 years (Preferred)Work Location: One location", "553": "Summary: American Conservation Experience, a Non-Profit Conservation Corps based in Flagstaff, AZ, in partnership with the Save Our Bosque Task Force (SOBTF), is seeking TWO Riparian Monitoring Members to dedicate 12 weeks in support of the SOBTF mission to preserve, protect, and enhance the Rio Grande and its adjoining riparian ecosystem (bosque, wetlands, grasslands) while respecting the customs and cultures of the residents of Socorro County. The main duties include assisting with vegetation surveys, invasive plant mapping, invasive species and project site monitoring, and community outreach. This opportunity is intended for conscientious, enthusiastic individuals with an interest in developing their field skills in vegetation and resource management.\n\nStart Date: May 24th, 2021\n\nEnd Date: August 13th, 2021\n\n * A 12-week commitment is required *\n\nLocation: Middle Rio Grande Valley in Socorro County, New Mexico. \n\nThe Save Our Bosque Task Force (SOBTF) is a 501 c(3) nonprofit corporation formed in 1994 by citizens of Socorro County, New Mexico, concerned about degradation of the ecosystem along the Rio Grande bosque. Save Our Bosque Task Force is a collaborative organization that involves private citizens, floodplain landowners, conservation organization, and state and government agencies. \n\nThe Save Our Bosque Task Force's mission is to preserve, protect, and enhance the Rio Grande and its adjoining riparian ecosystem (bosque, wetlands, grasslands).. The SOBTF works to provide public recreation, environmental education and a sustainable Rio Grande while allowing for historical resource uses. SOBTF plans and implements riparian enhancement projects that provide for public safety, ecosystem health, and private landowner goals, all within the confines of current infrastructure and limitations.\n\nSocorro, New Mexico is a small community of approximately 10,000 people in central New Mexico. Situated on the west side of the Rio Grande, it has a rich history in Native American and Hispanic cultures, mining, ranching, farming, and exploration. New Mexico Tech University is located in Socorro with strong science and engineering fields and associations with the NM Mineral and Gem Museum, NM Bureau of Geology, and the National Radio Astronomy Observatory. Socorro is probably best loved for its wide-open spaces and outdoor recreation opportunities. There are two National Wildlife Refuges and many state refuges nearby, Bureau of Land Management scenic byways, US Forest Service mountain trails, National Wilderness Areas, and State Parks close by. \n\nProject Partner Website: For more information regarding the Save Our Bosque Task Force, please visit their website at: http://www.sobtf.org. For more information on the ACE Internship Program, please visit: www.usaconservation.org.\n\nLiving Allowance: The ACE interns receive a living allowance of $400/week for food and incidental expenses, distributed bi-weekly. Housing will be included at no cost.\n\nAmeriCorps: This position may be eligible for a 450-hour AmeriCorps Education Award of ($1,638.89) upon successful completion of internship hours. Additional enrollment is required.\n\nBackground: The Save Our Bosque Task Force (SOBTF) is a 501c (3) nonprofit corporation formed in 1994 by citizens of Socorro County, New Mexico, concerned about degradation of the ecosystem along the Rio Grande bosque. Save Our Bosque Task Force is a collaborative organization that involves private citizens, floodplain landowners, conservation organizations and state and government agencies. \n\nThe Save Our Bosque Task Force's mission is to preserve, protect, and enhance the Rio Grande and its adjoining riparian ecosystem (bosque, wetlands, grasslands) while respecting the customs and cultures of the residents of Socorro County. The SOBTF works to provide public recreation, environmental education and a sustainable Rio Grande while allowing for historical resource uses. SOBTF plans and implements riparian enhancement projects that provide for public safety, ecosystem health, and private landowner goals, all within the confines of current infrastructure and limitations.\n\nPosition Description: The SOBTF Riparian Monitoring Program is designed to analyze the success of restoration projects and inform management decisions to ultimately protect, restore, and maintain the ecological health within the Middle Rio Grande Valley. The selected individuals will mainly be assisting with vegetation surveys, invasive plant mapping, and invasive species and project site monitoring along with community outreach. The Monitoring members will monitor sites throughout the Middle Rio Grande Valley, including private, state and federal lands. They will also help conserve the Park's natural resources through a wide variety of vegetation management and monitoring actions. Interns will provide some assistance with research projects, outreach and environmental education, and maintenance of riverine parks. SOBTF Program Director will provide on-site oversight of all Monitoring Intern activities and maintain safety standards through the field season's activities.\n\nProject Conditions/Physical Demands: Conditions will be variable and extreme throughout the summer. A substantial amount of project duties will involve serving long days in the dense riparian forest where it is hot and humid. Applicants should carefully consider that fieldwork is challenging. Selected candidates will serve ~40 hour/week.", "1316": "Organization\nU.S. Department of Defense (DOD)\nReference Code\nMRMC-AARL-2021-0004\nHow to Apply\nDescription\nThe Department of Defense (DoD) is offering recent graduates with a Bachelor's, Master's, or Postdoctoral degree internship opportunities at the U.S. Army Aeromedical Research Laboratory (USAARL).\nWhat will I be doing?\nAs the selected candidate, you will gain experience in injury and performance biomechanics by engaging in specialized research described in grants, proposals, and other material in support of USAARL’s Injury Biomechanics and Protection Group mission.\nWhy should I apply?\nUnder the guidance of a mentor, you will gain hands-on experience to complement your education and support your academic and professional goals. Along the way, you will engage in activities and research in several areas. These include, but are not limited to:\nEngaging in multiple aspects of research including, but not limited to: protocol development; testing equipment and apparatus design; testing setup/preparation; participant recruitment; data collection; and data analysis.\nDrafting and assisting in the preparation of reports, presentations, and other documentation on research progress and findings to be distributed, presented, and/or discussed within the laboratory and/or at scientific forums outside the laboratory.\n\nWhere will I be located?\nFort Rucker, Alabama\nWhat is the anticipated start date?\nThe USAARL is ready to make appointments immediately. Exact start dates will be determined at the time of selection and in coordination with the selected candidate. Applications are reviewed on an ongoing basis and internships will be filled as qualified candidates are identified.\nWhat is the appointment length?\nThis appointment is a twelve month research appointment, with the possibility to be renewed for additional research periods. Appointments may be extended depending on funding availability, project assignment, program rules, and availability of the participant.\nWhat are the benefits?\nYou will receive a stipend to be determined by USAARL. Stipends are typically based on a participant’s academic standing, discipline, experience, and research facility location. Other benefits may include the following:\nHealth Insurance Supplement (Participants are eligible to purchase health insurance through ORISE)\nRelocation Allowance\nTraining and Travel Allowance\nAbout U.S. Army Aeromedical Research Laboratory\nThe U.S. Army Aeromedical Research Laboratory (USAARL) located at Fort Rucker, Alabama, is a nationally recognized laboratory for research into safety, survival, impact tolerance, sustainability and performance effectiveness of aviators and Soldiers. The USAARL’s research focuses on blunt, blast and accelerative injury and protection; crew survival in military helicopters and combat vehicles; the en route care environment; human operator health and performance in complex systems and sensory performance, injury and protection. Current USAARL work for the Army’s modernization priorities includes research in the areas of future vertical lift, the next generation combat vehicle and directed-energy weapons. The Laboratory’s highly skilled workforce consists of rated aviators, medical professionals, doctoral- and masters-level researchers, and research technicians. Visit https://www.usaarl.army.mil/ to learn more about USAARL.\nAbout ORISE\nThis program, administered by Oak Ridge Associated Universities (ORAU) through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and DoD. Participants do not enter into an employee/employer relationship with ORISE, ORAU, DoD or any other office or agency. Instead, you will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE. For more information, visit the ORISE Research Participation Program at the U.S. Department of Defense.\n\n\nQualifications\nThe qualified candidate will have a Bachelor's, Master's, or Doctoral degree or will have completed by December 31, 2021. Degree must have been received within two years of the appointment start date.\nHighly competitive applicants will have education and/or experience in one or more of the following:\nM.S. in kinesiology, biomechanics, or related engineering (biomedical, mechanical, electrical) field plus at least 4 years of experience in research, engineering or clinical settingPh.D in kinesiology, biomechanics, or related engineering (biomedical, mechanical, electrical) field with experience in research, engineering or clinical settingKnowledge of commonly-used concepts, practices, standards, and procedures within biomechanics and mathematics as demonstrated through a degree and coursework in a relevant STEM (Science, Technology, Engineering, and Mathematics) field from an accredited program.\nCertified athletic trainer (ATC) preferred, but not requiredMilitary experience (active duty, guard, reserve) or environment familiarity is a plusExperience with conducting human volunteer screening, assessments, and evaluations in research or clinical settings; experience working with military populations is a plusDemonstrated experience with human volunteer performance and kinematic motion tools, techniques, and methodology for data capture and analysisAbility integrate complex medical and engineering methodologies and equipment, including but not limited to motion capture systems, medical and physiological stimulation and measurement systems (e.g., EMG, dynamometer), and engineering instrumentation (e.g., accelerometers, load cells, force plates, IMUs), software (e.g., MATLAB, SAS), and data acquisitionMathematics and data analysis and acquisition experience, including scientific software packages and principles of data acquisitionGood computer skills with advanced knowledge and experience in Microsoft Office Suite softwareExcellent communication and interpersonal skillsStrong organizational skills and detail oriented\nApplication Requirements\nA complete application consists of:\nZintellect Profile\nEducational and Employment History\nEssay Questions (goals, experiences, and skills relevant to the opportunity)\nResume (PDF)\nTranscripts/Academic Records - For this opportunity, an unofficial transcript or copy of the student academic records printed by the applicant or by academic advisors from internal institution systems may be submitted.\nTwo Recommendation\nIf you have questions, send an email to ARMY-MRMC@orise.orau.gov. Please list the reference code of this opportunity [<<reference code>>] in the subject line of the email.\nConnect with ORISE...on the GO! Download the new ORISE GO mobile app in the Apple App Store or Google Play Store to help you stay engaged, connected, and informed during your ORISE experience and beyond!\nEligibility Requirements\nCitizenship: U.S. Citizen Only\nDegree: Bachelor's Degree, Master's Degree, or Doctoral Degree received within the last 60 months or anticipated to be received by 12/31/2021 11:59:00 PM.\nOverall GPA: 3.00\nDiscipline(s):\nCommunications and Graphics Design\nComputer, Information, and Data Sciences\nEarth and Geosciences\nEngineering\nEnvironmental and Marine Sciences\nLife Health and Medical Sciences\nMathematics and Statistics\nOther Physical Sciences\nOther S&E-Related\nPhysics\nSocial and Behavioral Sciences\nAge: Must be 18 years of age", "1459": "For employment and internship opportunities, please submit your resume, cover letter and compensation requirements to:\n\nTNT Environmental, Inc.\nAttn: Human Resources\n4455 Brookfield Corporate Drive\nSuite 100\nChantilly, Virginia 20151\n\nEmail: Info@TNTenvironmentalinc.com\nPhone: 703-466-5123\nTNT is seeking an Environmental Scientist with 3-5 years of relevant experience for its Chantilly, Virginia office. Qualified candidates should have a degree in Biology, Ecology, Botany, or Environmental Science, well developed written and oral communication skills and a desire to work in a team-oriented environment. The position will entail a mixture of office and field work in all seasons of the year.\n\nThe primary responsibilities of the position are to conduct and manage routine to complex wetland and natural resource projects, work closely with a team of wetland and natural resource professionals and business development. Fundamental and working knowledge of local, state and federal regulatory regulations and processes in Virginia, Maryland, DC and West Virginia is critical."}, "company_name": {"1716": "U.S. Department of Energy (DOE)", "1357": "EMDO Laboratory", "553": "American Conservation Experience", "1316": "U.S. Department of Defense (DOD)", "1459": "TNT Environmental"}, "company_location": {"1716": "Los Alamos, NM", "1357": "Laurel, MD", "553": "New York, NY", "1316": "Fort Rucker, AL", "1459": "Chantilly, VA"}, "source": {"1716": "indeed", "1357": "indeed", "553": "tamu", "1316": "indeed", "1459": "indeed"}, "job_link": {"1716": "https://www.indeed.com/rc/clk?jk=e90546a71883c27a&fccid=9ee66ada40315e6d&vjs=3", "1357": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CdcVd3SDA1nO7RkKTAACmPV4xEt72Vls8LI2dqcgyOeNkJqeUYyyJKk0Gr_o_G7GAlt_BZRJgvLc6cQcMcWM5E9h7kY39akwvRZzloqQgt9OuGx0UI91XeH4CS-anHlLGY8XYdG0EOFO-vKJkoGAOWMIpQTYvjloE9r0CMz1UDRcZbuFhRssnhXzMCA9iI4p5-v5vbv19UsYjjzMp32awVYOqaU3jtxDQHzIyG0uEPxf91CBEfYtl2dmo1ka5TtDK80KM3v8_9vJdBGMm3ASx-EmXVUqV0LO3rKmErFk0R0fXOcIUDaP2Z3dlyADiP4yc5Ki4-6oG85tgvV_0Gq_UlkarhjFsfRMnv2bh7NKef2O2FrXPLPDfNlhFv8lliyCEShpHEljNXm7ufmW8lfGJDj6yEmVOaUGBC1yaJ1gPKbPGaP401TxWylGIUK8jJptw8nGMRSVJ7KTHcv5IFdeNmIiD3aHu9Z4ebe5bOsXyHlQ==&p=14&fvj=1&vjs=3", "553": "https://wfscjobs.tamu.edu/jobs/ace-riparian-monitoring-members-save-our-bosque-task-force-nm-americorps-eligible-2/", "1316": "https://www.indeed.com/rc/clk?jk=44addb2b3b8c346f&fccid=9ee66ada40315e6d&vjs=3", "1459": "https://www.indeed.com/rc/clk?jk=d77583df76ada449&fccid=24f6562f4e7b82ea&vjs=3"}}, "unspecified": {"job_title": {"105": "Exotic Cat Sanctuary Internship- Wylie, Texas", "52": "Winter Caretaker: McCall, ID", "363": "Whitetail Bottle Feeding Internship: Texas", "825": "Prairie Grouse Conservation Internship: Texas", "879": "Coastal Wildlife internship- Summer: Texas", "1050": "Organ Mountains/Las Cruces District Office Outdoor Recreation Planner- Las Cruces, NM", "1457": "Sustainability Toolbox Community Manager", "1498": "Information Assistant", "1758": "Plant Nursery Associate", "1760": "Greenhouse Assistant", "56": "AmeriCorps VISTA: BIPOC Program Development Member", "58": "The Wildlife Center at Legends Ranch-Internship", "73": "Administrative/Accounting Assistant: Texas", "76": "Veterinarian programme South Africa (Wildlife, large and small animals)", "115": "Integrated Fire and Recreation Intern: Texas", "187": "Public Affairs Specialist: New Mexico", "194": "Whitetail Herd Health Intern: Texas", "197": "Wildlife Internship – Sweden Ranch Benavides TX", "226": "Whitetail deer ranch intern: Kentucky", "264": "Conservation Internship Westcave Preserve- In Round Mountain, Texas", "297": "Ranch / Wildlife Management Fall Internship MT 7 RANCH: Texas", "329": "Bird Banding Apprenticeship; Belize", "331": "Fall Deer Breeding Internship: Texas", "345": "Wildlife Publishing Intern Fall 2021: Remote", "408": "Wildlife Systems Intern: TEXAS", "436": "Whitetail Nursery Intern: Texas", "450": "Conservation Intern: Mason, MI", "516": "Wildlife Internship, Tilden, TX", "529": "GIS Internship: Texas", "545": "Summer Public Programs Internship: Manteo, NC", "561": "Fawn Raising Summer Internship in Texas", "563": "Large Cat Internship @ In-Sync Exotics, Texas", "581": "Internship at deer breeding facility: Texas", "617": "Land Conservation Internship – Vashon Island, Washington", "626": "Summer Intern- Washington", "649": "Wilderness Steward Internship – Absaroka-Beartooth Wilderness, Montana", "674": "Goose Island State Park Summer 2021 Internship- Rockport, Texas", "676": "Fisheries Internship — Tiller, Oregon", "687": "Whitetail Breeding Internship; Millsap, TX", "688": "Fawning and Deer Breeding Internship – Sonora, TX", "718": "Big Rivers Intern (Paid) – Missouri", "756": "Lake and Pond Technician: Kansas/Missouri", "787": "Nest-searching Intern (1) – southwestern Oregon", "826": "San Antonio Deer & Cattle Internship: Bulverde, Texas", "837": "Aquaculture/Water Quality Internships, Cape Cod, MA", "846": "Summer Whitetail Breeding Internship in Texas", "874": "M3 Whitetails Summer Internship: TEXAS", "880": "Streaked Horned Lark Field Assistant – Corvallis, Oregon", "899": "Experience ORISE Virtual Career Fair: STEM, Policy, and Technical Internships and Fellowships: Virtual", "927": " Procurement and Administration Support Member: Denver, CO *The position will be remote until in-person work is determined allowable by senior leadership", "1459": "Environmental Scientist"}, "full_job_description": {"105": "In-Sync Exotics is verified by the Global Federation of Animal Sanctuaries and accredited by the American Sanctuary Association. We currently are home to over 70 exotic cats including lions, tigers, leopards, cougars, lynx, servals and a cheetah. We offer 3-month and 6-month internships, designed to expand your knowledge in the care of exotic cats and the running of a sanctuary. \n\nExperience includes diet preparation, feeding, cleaning enclosures, enrichment, observation of medical care at our on-site clinic, record keeping, public education/tours, building new enclosures/general maintenance and more. \n\nOur interns work hard in all kinds of weather conditions, in a small close-knit team and learn a great deal about all aspects of exotic cat care. \n\nLocated 45 minutes northeast of Dallas, interns get to enjoy exploring the DFW metroplex, it's lakes and surrounding areas on their 2-day weekend. \n\nCompensation: Onsite housing and a weekly stipend ($50/week)\n\nWe are currently accepting applications for the following terms: \nWinter: November 28, 2021 – February 19, 2022\nSpring: February 28, 2022 - May 21, 2022\nInternships are minimum 12 weeks.\n\nResponsibilities\nInterns will experience a wide variety of tasks throughout the day. Beginning with pulling heavy boxes of meat to thaw, followed by cleaning outdoor and indoor exhibits, preparing diets, preparing and distributing enrichment, record keeping and grounds maintenance. \nAdditionally, interns will assist keepers in feeding and medication administration. \nThere are opportunities during the internship to learn more about veterinary care and behavioral training. A day’s work can be long hours especially in the case of an emergency. \n\nWork begins at 8am and sometimes doesn't finish until 6pm. Once a week interns will be required to carry out a night shift (7.30pm -11pm). The following day work would begin at 10am. A week is 5 days of work with a 2-day weekend.", "52": "Part time winter caretaker position offered at wildlife rehabilitation center in central Idaho. Snowdon is a small, non-profit operation whose mission is to rescue and rehabilitate injured and orphaned animals and return them to the wild. Winter animals include resident educational birds, rehab bear cubs, and occasional rescue animals. Duties include SNOW REMOVAL, grounds maintenance, food preparation and feeding, cleaning enclosures, general observation of animals’ health, keeping clinic clean, and answering the telephone. 4-wd vehicle recommended during winter\n\nFull-time housing offered in exchange for 4 days/week caretaker duties. Work schedule allows for picking up a part-time job in the community, compatible with Snowdon schedule\n\nTo Apply: submit (1) a cover letter describing your interest, (2) a resume, and (3) contact info for 3 references. Email application packet to snowdonwildlife@gmail.com Immediate start date. Position open until filled", "363": "•\tTagging and bottle raising whitetail fawns\n•\tFeeding\n•\tCleaning and maintaining bottle fawn barn \n•\tAssisting in AI and ET programs\n•\t Assisting in weaning and vaccinating \n•\tGeneral ranch work \n•\tCleaning and maintaining the grounds and facility", "825": "***** $300/month and free housing! *****\n\nFossil Rim Wildlife Center is a not-for-profit, AZA accredited organization, and the Prairie Grouse Conservation Internship focus is on the breeding season of the highly endangered Attwater’s Prairie Chicken. Fossil Rim Wildlife Center offers its Prairie Grouse Conservation Internship from April to August (dates are flexible). This breeding program is paramount in the reintroduction and recovery of this species of prairie grouse. Interns take part in the daily feeding, cleaning, diet preparation, visual observations, chick development, and daily assessments. Healthy chicks are then slotted for future breeding, or for the annual U.S. Fish and Wildlife Service release program. \n\nResumes are accepted year-round for this position. Applicants must be available from late March / early April through July / August. This internship is only available during the spring semester. Candidates should have an interest in and dedication to wildlife conservation. Must be graduated or out of school due to the internship coinciding with the breeding season of the Attwater’s prairie chicken. Interns will be required to work weekends, holidays and in inclement weather including 100º temperatures. Strong communication and organizational skills are necessary as well as attention to fine details. Being able to work independently but in a team atmosphere is also required. Similar to the other internships at Fossil Rim, on-site housing and transportation are provided. A valid driver's license is required.\n\nInternational students must have a J1 or B1 visa before arrival. Fossil Rim will not sponsor or assist with the visa process. Interns cannot come on a visiting visa.\n\nIf selected, candidate must have a TB test conducted within 30 days prior to arrival for internship.\n\nApplication Deadline: March 1st (applications reviewed on rolling basis)\nResumes will be accepted through March 1st for the upcoming Spring season. This internship is only available during the spring semester. You must have a valid driver’s license.", "879": "Fill and maintain corn and protein feeders.\n\nAssist with wildlife surveys for deer, axis, and migratory birds\n\nScout wildlife for hunting season\n\nHunting season duties including skinning and cape preparation\n\nAssist with maintenance and management of water in wetlands\n\nCleaning of ranch vehicles and facilities. \n\nApplication of herbicides for habitat management\n\nMaintenance and upkeep of ranch equipment and facilities\n\nHeavy equipment operation and maintenance (tractors, skid steers, bulldozer)\n\nFence construction, repair, and maintenance\n\nAssist with any and other ranch activities as assigned by ranch and/or wildlife managers to aid in the development and startup process of ranching and wildlife operations\n\nRanch vehicle provided during work hours.\n\nHousing provided, all utilities paid.", "1050": "Title: Organ Mountains/Las Cruces District Office Business Plan Intern (1 opening) \nStart/End Date: January 18, 2021- December 17, 2021 (anticipated) \nStipend: $500/week (+Education Award)\nTerm: 48 weeks\nReports To: Edna Flores (Outdoor Recreation Planner)\nLocation: BLM Las Cruces District Office (1800 Marquess St., Las Cruces, NM 88005)\nStatus: 1700-hour AmeriCorps Service Term\nBenefits: AmeriCorps Education Award $6,095; Public Lands Corps Certificate; both with successful completion of the internship. \n\nSummary:\nConservation Corps New Mexico (CCNM):\nConservation Corps New Mexico, a program of Conservation Legacy, aims to continue the legacy of the Civilian Conservation Corps of the 1930s. CCNM is focused on connecting youth, young adults, and recent era military veterans with conservation service work projects on public lands. CCNM operates programs across southern New Mexico and western Texas that engage individuals and strengthen communities through service and conservation. The CCNM Individual Placement Program is managed by the Arizona Conservation Corps office in Tucson, Arizona. The CCNM program office in Las Cruces manages the CCNM field program. \n \nPosition Summary:\nThe Bureau of Land Management Recreation and Visitor Services Program works to enhance recreational opportunities for the public. The BLM manages recreation resources and visitor services to offer the greatest benefits possible to individuals and communities and to better enable communities to achieve their own desired social, economic, and environmental outcomes.\nThe BLM's Las Cruces District Office is seeking one intern to work directly with Outdoor Recreation Planners from the Organ Mountains-Desert Peaks National Monument and the Las Cruces District Office. The intern will focus on creating business and spending plans for the Monument and District Office. The plans will detail how the sites plan to implement or eliminate fees, expand or limit the recreation fee program, and implement fee level changes. \n\nEssential Responsibilities and Functions:\n•\tCreate a business plan for the monument and district, and address how the sites plan to implement or eliminate fees, expand or limit the recreation fee program, and implement fee level changes.\n•\tConduct market research in nearby areas to ensure that proposed fee changes reflect the current market values. \n•\tCreate functional operating plans for the monument’s recreation sites detailing objectives, goals, procedures, and timelines of the Monument and the District’s physical necessities.\n•\tLead public outreach efforts for the business plan to be made available to the public, stakeholders, and the corresponding Resource Advisory Councils.", "1457": "The Toolbox team is looking for a Toolbox Manager with relevant sustainability and client management knowledge and/or qualifications. [www.sustainabilitytoolbox.com]This position could be undertaken full time as an entry level role, part-time at an experienced level, or could be undertaken as a job share or similar.This is a 12-month contract with scope for renewal.Ideal start date: 1st AprilGeneral Summary11th Hour Racing Team, is a professional sailing team with sustainability at the core of all team operations, inspiring positive action among sailing and coastal communities, and global sports fans to create long-lasting change for ocean health.11th Hour Racing Team have created an open source framework The Toolbox, to make the creation and implementation of a sustainability program accessible to the wider community.Launched May 31, 2021, The Toolbox provides a standardised and streamlined approach to the creation of sustainability programs which aligns with existing sustainability standards. The Toolbox is provided in a simplified open access format and delivers a set of practical resources (including how-to guides, templates and case studies) and creates a framework that defines the step by step process of establishing the fundamentals of a sustainability plan; from establishing the scope and mapping stakeholders to defining the actions and the reporting process. The Toolbox is available in English and French.General Role: The role is to promote, facilitate outreach and maintain The Toolbox, and to provide user support.The Toolbox community manager will report to the Sustainability Program Manager (SM) at 11th Hour Racing Team.The candidate will be expected to work closely with the The Toolbox Steering Committee, including sustainability, communications, marketing and partnership departments.The candidate could be full time, or part-time at a more experienced level.Principal Duties and ResponsibilitiesSupporting the growing community of Toolbox users:Managing registrations, enquiries and downloadProcessing uploads and feedbackProviding user supportPromoting and marketing The Toolbox to new and existing networks:Drafting marketing and outreach contentReaching out to new organizations and networksEnsuring The Toolbox is available and referenced in relevant databasesFacilitate outreach:Creating and facilitating the delivery of webinar and workshop contentMaintaining, and developing The Toolbox website and assets:Coordinating periodical updates to both the website and The Toolbox assets based on user feedbackCoordinating language supportReportingRunning periodical surveys and analysing resultsProviding overall assessment reportsJob Requirements Education and technical experience:Knowledge of client management and applied sustainabilityUnderstanding of international sustainability protocols including UN Sustainable Development Goals, Global Reporting Initiative Standards, ISO Standards and other relevant corporate reporting standards.Knowledge of PR and communications, and client supportGeneral skills and knowledge:Business fluent written and spoken English; other languages are desirableExcellent writing skills, computer skills, with project reports, with experience in basic knowledge of web designProject management abilitiesStrong stakeholder engagement and public relation skills; comfortable working with a variety of audiences and client basesAbility to present webinars and run workshopsAbility to work both collaboratively within a small team with stakeholders, and to work independently as neededMust adhere to deadlines, in an international environmentMotivated to see positive sustainable and regenerative changeWork venue: This tele-work role will be primarily undertaken offsite at the Toolbox Community Manager’s home/work office/venue of choice, as such we welcome international applicants and can make accommodations including flexible hours.While performing the duties of this position, the Toolbox community manager is required to work effectively across global time zones and cultures, as such access to high quality internet is a prerequisite.Commitment to Diversity: 1 Degree is committed to creating a diverse environment. The team's intention is for a proactive inclusive approach to creating an equal opportunity workplace. All applicants will receive consideration without prejudice.Pay scale: The remuneration for the role will be adjusted to reflect the level of the candidate’s experience.Job Types: Full-time, Part-time, Contract, InternshipContract length: 15 monthsPay: $25,000.00 - $28,000.00 per yearBenefits:Flexible scheduleSchedule:Monday to FridayWork Location: RemoteReference ID: Toolbox Community ManagerExpected Start Date: 04/01/2022", "1498": "United States Forest Service - Resource Assistants ProgramSuperior National Forest Information AssistantOrganization:  Superior National Forest, Tofte Ranger DistrictPartner Organization(s):  The Corps NetworkLocation:  Tofte, MNTerm of Service:  7 monthsWage:  $500 per weekStart Date:  March 2022United States Forest Service Resource Assistants Program (RAP) is a rigorous and immersive, paid internship for individuals interested in Forest Service careers. Resource assistants work under the supervision of Forest Service staff to complete mission-critical work that demonstrates leadership, critical thinking, and strategic communication. Through collaboration, training, and mentorship, resource assistants gain the tools to launch their natural and cultural resource careers.RAP seeks to engage highly motivated candidates through these program objectives:Instill stewardship values in the next generation of natural and cultural resource management professionals;Expand and enhance the capacity of the Forest Service to accomplish mission-critical work and high-priority projects;Attract and retain a diverse and inclusive workforce to support the Forest Service’s mission to “sustain the Nation’s forests and grasslands to meet the needs of present and future generations.”Position Description: Information Assistant will provide general administrative and customer service support for Tofte Ranger District staff and public. The intern performs a variety of record keeping, reporting, and informational duties in support of the mission. In addition, the intern performs logistical and associated general clerical work. Individual will receive on-the job training in planning, organizing and executing information, external relations and other administrative activities to develop experience in various phases of public service and administrative support.Position Duties and Responsibilities: The Information Assistant Intern will:Possess exceptional ability to work with people in person and on the phone.Position consists of greeting customers at the front desk and issuing Boundary Waters Canoe Area Wilderness (BWCAW) permits to wilderness users and providing user education on Leave No Trace camping.Money handling skills is essential for collecting fees for wilderness permits and processing payment, selling Forest Service senior passes, maps, and forest product permits. Selling merchandise & making deposits for an interpretive store such as sweatshirts, guide books, and maps.Uses database or spreadsheet software to accurately enter, revise, sort or calculate, and retrieve data for standard reports.Answering incoming phone & email inquiries regarding camping, fishing, and hiking opportunities on the National Forest.Working with BWCAW Cooperators for issues regarding Recreation.Gov for wilderness permits. Provide graphic design support for a variety of communication materials.Provide administrative support related to Ranger District operations.Reads and processes incoming correspondence and material. Ensures that correspondence is properly routed in a timely manner.This intern provides services such as greeting the public, providing visitor information, answering phones, selling maps and permits, networking with other information outlets and creating/updating handouts.Office is open 7 days a week and weekend & holiday work is required.Education and Qualifications: Information Assistant Intern should possess the following educational and experiential qualifications:Excellent oral and writing communication skills.Experience and interest in diversity issues related to the conservation workforce is preferred.Demonstrates quality customer service, and a personable attitude.Demonstrates experience in professional presentations, fact sheets, website content, and other communication materials.Knowledge of best practices and experience with customer service in a professional setting.A bachelor’s degree, or higher degree, in communication, journalism, or related field.Abilities and Skills: Information Assistant Intern to possess:The ability to prepare materials in a clear and professional manner through excellent written and oral communication, and interpersonal skills.Ability to work well, and be flexible in, a team-oriented environment.A strong attention to detail.Ability to understand and interpret diversity in the conservation workforce.Ability to manage multiple tasks and responsibilities concurrently.Duration: 7 months: March – October 2022Office is open 7 days a week and weekend & holiday work is required.Location: Superior National Forest, Tofte Ranger DistrictTofte, MNCompensation and Benefits: $500/weekHealth insurance benefits$1,000/month housing allowanceGenerous professional development allowanceOpportunities for paid work travel, training sessions, and conferences.Opportunities to network with U.S. Forest Service field staff and professionals.RAP Direct Hire and Noncompetitive Hiring Authority: After completing and meeting program requirements, interns may become eligible for the RAP Direct Hire and noncompetitive hiring authority through a 2-year certificate of eligibility.How to Apply: Please submit a resume, cover letter, and references to apply.For questions regarding this Resource Assistant Program Internship, please contact The Corps Network.Partner Organizations: About The Corps Network: The Corps Network is the National Association of Service and Conservation Corps. Our 130+ Corps provide young adults and veterans the opportunity to serve our country through projects on public lands and in rural and urban communities. The Corps Network supports Corps by advocating on their behalf, providing access to funding and project opportunities, and by offering expertise in Corps operations and programming.Job Types: Full-time, InternshipPay: $500.00 per weekBenefits:Health insuranceProfessional development assistanceRelocation assistanceSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Tofte, MN: Reliably commute or planning to relocate before starting work (Preferred)Education:Associate (Preferred)License/Certification:Driver's License (Required)Work Location: One location", "1758": "For over 25 years Paradise Nursery has grown Southern California's highest quality plants and trees. We are looking for associates to aid in nursery operations and customer service.- Duties include care of nursery stock plant care- Irrigation, Pruning, and Fertilization- Facilities Management - Irrigation management- Order fulfillment (heavy lifting)- Potential Customer Service and Management AssistanceCandidates with experience in constructions, remodeling, landscape maintenance, irrigation, and landscape development, sports and Military are encouraged to apply.Job Types: Full-time, Part-time, Temporary, InternshipPay: $15.00 - $20.00 per hourSchedule:8 hour shiftWork Location: One location", "1760": "We are in need of someone with horticulture experience. The job requires the ability to be involved in all aspects of the production and selling of annuals to wholesale customers. Filling, planting, watering, moving, pulling and loading orders is required. Needs to be able to lift 60 lbs comfortably and have the capability to work fast. Good work ethic and drive are vital.Job Types: Full-time, Part-time, InternshipPay: $12.00 - $15.00 per hourBenefits:Paid time offSchedule:Monday to FridayWeekend availabilityAbility to commute/relocate:Raleigh, NC 27603: Reliably commute or planning to relocate before starting work (Preferred)Education:High school or equivalent (Preferred)Experience:Greenhouse & Nursery Growers: 1 year (Preferred)Work Location: One location", "56": "This is an opportunity through the Americorps VISTA program. Learn more about VISTA by visiting https://www.americorps.gov/serve/fit-finder/americorps-vista\n\nThe VISTA at Canyonlands Field Institute (cfimoab.org) will work to increase marketing and fundraising to expand our education programs for youth from BIPOC focused programs.\n\nThe CFI VISTA will focus on increasing opportunities for experiential learning through outdoor education for participants from BIPOC focused programs. Outdoor education offers a unique opportunity to challenge people in new surroundings while practicing scientific processes and developing social and emotional skills related to self-awareness and communication. These lessons are a valuable pathway to positive outcomes and breaking the cycle of inequity.  Working for the Marketing and Communications Director, the VISTA will: identify BIPOC organizations with environmental education interests; create a marketing and fundraising plan to attract BIPOC programs to CFI programming; and learn to guide trips to identify barriers and ladders over barriers for BIPOC participants on future outdoor education trips.\n\nCFI’s mission is to provide quality outdoor education programs that inspire care of wild places and renew the human spirit.  By combining Social and Emotional Learning with hands-on science education, our curriculum is specifically designed to deepen connections between students and their surroundings. Our science lessons are framed through SEEd and NGSS standards, and we specialize in creating an experience specifically suited to a school’s educational goals. In addition, our Social and Emotional Learning curriculum intentionally teaches skills in self-management, group awareness, responsible decision making, and communication. CFI has over 35 years of experience leading outdoor expeditions for schools. Our educators bring science to life, connect with students, and provide guidance and technical skill education. We strive to provide meaningful outdoor experiences for all students.  Many of our program costs are subsidized through grants, donations, and memberships. We are currently partners in the Working Towards Racial Equity project with UC Berkeley and Justice Outside.\n\nCFI looks for energetic, thoughtful employees who work well with a team and are ready to contribute to a small, well-meaning organization.", "58": "Wildlife Center Overview\n\nWe are actively seeking two (2) wildlife or education professionals to intern at The Wildlife Center at Legends Ranch in Bitely, Michigan.  The Wildlife Center at Legends Ranch is a 501 c3 Non-Profit, 24 thousand square foot facility featuring 2,500 animals from around the world. The center offers a one of a kind experience for students, families, hunters and friends where they are able to learn the importance of hunting and conservation. Our mission is to provide and promote education regarding scientific, environmental, conservational, and historical topics and issues.\n\nWildlife Center programs include:\n•\tEducational field trips\n•\tWildlife-related degree scholarships\n•\tConservation for threatened species\n•\tLegends Ranch Youth Challenge & Purple Heart Hunts\n\nIntern responsibilities:\n•\tHelp create and develop educational programs for students and visitors to learn about conservation through hunting.\n•\tHelp brainstorm, develop and organize ideas to further the wildlife center’s mission.\n•\tAssist in developing a website to showcase our programs.\n•\tFundraise and send out publications of our progress through social media, newsletters and other outlets. \n•\tSchedule and guide tours for all programs.", "73": "Seeking Administrative / Accounting Assistant. Successful candidates will exude great pride in their work, welcome challenging assignments, viewing them as opportunities for continued learning and personal growth, be extremely detail orientated, have excellent communication skills. Must be reliable. It's a flexible position. If you're looking for a challenging, fast-paced and rewarding opportunity and this position sounds interesting, please submit your resume for consideration.\n\n Responsibilities\n\n• Answer telephone inquiries from customers for pricing information.\n• Make payment on my behalf.\n• Issue invoices to and collect from customers\n• Payroll accounting\n• Account receivable and payable\n• Contact vendors to inquire on costs and availability of products.\n• Record and pay accounts payable if needed.\n\n      If you're looking for a challenging, fast-paced and rewarding opportunity and this position sounds interesting, please submit your resume for consideration.", "76": "This internship was designed for students who have completed at least 1 year of a veterinary course. The internship structure is an equal mix of small animal, large animal, and wildlife aspects, as in the Vet Experience program, however, the Vet Student Internship has more advanced skills and procedures, a smaller group size, and a full-time, highly qualified mixed-practice South African vet. Vet Student interns work alongside the vet, seeing a wide range of species, working through clinical cases, and participating in focused discussion groups. This internship has a limited number of sessions but vet students are also welcome to join our Vet Experience program!\n\nLearn about all the animals you'll be working with here.\n\nSmall Animal: \n\nAssisting at our non-profit small animal clinic (1-2 days per week)\nClinical exams, basic wound care, and treatment\nDiagnostics\nCommunity education\nDiscussion Topics: in-depth clinical case discussion, aggression, tick-borne disease, TVTs\n\nLarge Animal: \nCattle (beef & dairy): Pregnancy testing, dehorning, routine checks, wound care, treatment\n\nSheep & goats: Pregnancy scanning, tail docking & castrating lambs, routine checks, wound care, treatment\n\nPigs: Artificial insemination, tail docking (piglets), routine checks, wound care, treatment\n\nHorses: Lameness exams, dental exams, routine checks, wound care, treatment\n\nDiscussion topics: in-depth clinical case discussion, abattoirs, disease control\n\nWildlife:\nGame Capture: Vet Students work closely with the wildlife vet and their capture team to locate, immobilize, transport, and release wildlife, a process also known as “Game Capture”. As with the Vet Experience Program, there will be at least 1 game capture per week but working in a smaller, more experienced group you can expect to be more hands-on and more involved in the clinical aspects.\n\nGame counts & wildlife identification: Learn about land caring capacity and identify exotic species\n\nParasite control: Darting with parasiticides (firearm handling & safety training provided)\nDiscussion group topics: conservation, hunting, Five Freedoms\nTypical Animal Experience Hours: \nAnimal Experience (hours/week): 30-40\nVet Experience (hours/week): 40-50\nClinical Experience (hours/week): 20-30\nSurgical Experience* (hours/week): 0-10\nAnimal welfare is the most important factor to consider when allowing students to perform surgery- we cannot guarantee surgical experience in any session on any program, because welfare must be assessed in each case. The estimated number of student surgeries per week is based on past volunteer experiences, however, animal welfare conditions, student experience & confidence, weather, national holidays, and other variables may affect the availability of student surgeries.\n\nSample itinerary:\n\nMonday:\nCommunity Outreach (Large & Small Animal):\nHorses\nPigs\nGoats\nSheep\nCows\nDogs\n\n2\tTuesday:\nCattle pregnancy testing & vitamin injections (Large Animal)\nReptile handling (Wildlife)\n\n3\tWednesday:\nNon-Profit Small Animal Clinic (Small Animal)\n\n4\tThursday:\nDart gun introduction & training\nGame capture (wildlife)\n\n5\tFriday:\nSmall Animal Spay Day (Small Animal)\n\n6\tSaturday & Sunday:\nFree Time!", "115": "The Student Conservation Association (SCA) is partnering\nwith the Southern Region of the US Forest Service to administer\nthe Integrated Fire and Recreation (IFR) Internship. This program\nis designed to provide college graduates from under-represented\nand diverse backgrounds with opportunities to gain the skills\nnecessary to launch a career in fire, recreation or natural\nresource management.\nPROGRAM DETAILS:\nn Program Dates: January 10 - April 29, 2022\nn Internship starts with two weeks training consisting of\n• basic firefighter training\n• work capacity test (completing a 3 mile hike in\n45 minutes while carrying a 45 lb. pack)\n• basic trail management and maintenance\nn After training, member will spend 14 weeks on Forest\nService districts in the southeastern U.S. receiving\non-the-job training in fire, recreation, and natural\nresource management\n\nDEADLINE\nInterested candidates are encouraged to apply as soon as\npossible. Applications accepted on a rolling basis, but those\nsubmitted by October 9th, 2021 will be given priority.\n\nHOW TO APPLY:\n1. Complete an Internship/Corps Application online at thesca.org\n2. Add the promo code PO-00732201 to your application.\n3. Contact Chris Burley at CBurley@thesca.org or 312.239.1668\nwith any questions.\n\nSCA is an EOE dedicated to workforce diversity.", "187": "Title: Public Affairs Specialist (1 opening) \nStart/End Date: November 1, 2021 – July 29, 2022 (anticipated) \nStipend: $500/week\nTerm: 39 weeks\nLocation: BLM New Mexico State Office (301 Dinosaur Trail Santa Fe, NM 87508)\nStatus: 1200-hour AmeriCorps Service Term (90% office work and 10% field work) \nBenefits: AmeriCorps Education Award $4,336.50; Public Lands Corps Certificate*; both with successful completion of the internship. Health insurance eligible. \n \nSummary:\nConservation Corps New Mexico (CCNM): Conservation Corps New Mexico, a program of Conservation Legacy, aims to continue the legacy of the Civilian Conservation Corps of the 1930's. CCNM is focused on connecting youth, young adults, and recent era military veterans with conservation service work projects on public lands. CCNM operates programs across southern New Mexico and western Texas that engage individuals and strengthen communities through service and conservation. The CCNM program office in Las Cruces manages the CCNM field program.\n \nPosition Summary: This position serves as an entry-level Public Affairs Intern located in the Bureau of Land Management (BLM) New Mexico State Office. The incumbent performs assignments which develop the incumbent’s abilities to assist with planning, developing, and implementing public affairs products and strategies related to actions in all BLM programs. The incumbent applies standard communication methods to recurring, precedented public affairs assignments. Given the often high-profile, controversial, and conflicting nature of public opinion regarding BLM programs, the incumbent works closely with BLM Public Affairs Specialists, their supervisor, and/or the State Office Communications Chief, in order to ensure the BLM provides a consistent approach and accurate message to the public. Contacts are made in participation with or under the close supervision of a BLM mentor and involve managers and staff, interest groups, educational groups, and counterparts in government agencies on the national, state, and local levels.\n\n\n\n\n Essential Responsibilities and Functions:\n\n•\tIn coordination with BLM mentors, develops digital media plans, manages photo library, and produces photographs, digital audio content, and videos for use in print or digital media products as well as social media and websites. Reviews photographs and artwork for quality and composition. Works closely with the web and social media manager to issue products to the public and press. \n\n•\tAssists with the research, drafting and distribution of communication plans, news releases, talking points, fact sheets, letters, presentations, social media content, and strategies designed to further public, employee, and customer understanding and support of the BLM and its mission. Identifies to the supervisor issues and actions contained in BLM plans and programs that should receive public affairs emphasis. Gathers and reports public reactions to BLM activities or information programs. Draws appropriate conclusions and recommendations to improve communication programs and materials. \n\n•\tWith the assistance of BLM mentors, conducts the following activities a) coordinates logistics and helps prepare personnel for interviews with media and/or BLM personnel for agency-produced video content; b) assists BLM personnel in preparing for media coverage of special events; and c) assists BLM offices with public and internal meetings as required. \n\n•\tPerforms general administrative duties such as maintaining current and accurate lists of area leaders and elected officials for use in outreach; updates public affairs databases, spreadsheets, and workflow management systems; and updates and helps maintain the media contact list. \n\n•\tPerforms other duties as assigned.", "194": "Blue Creek Whitetails is a whitetail deer breeding facility located about 10 miles west of Falfurrias , Texas. Our operation is focusing attention on pedigree and marketability of animals in the breeder market as well as supplying ranches with stocker quality animals.                                                                                                                                                                 \n\nDuties to include but not limited to:\n\n•\tAssist in herd health \n•\tFeeding\n•\tAssisting in AI and ET programs\n•\t Assisting in weaning and vaccinating \n•\tGeneral ranch work \n•\tCleaning and maintaining the grounds and facility\n•\tOperating & maintaining equipment", "197": "Job Objective\nProvides the opportunity to gain valuable wildlife, habitat, and ranching experiences through applied management. Internship to begin mid-September 2021 and conclude February 2022. Basic housing and accommodations included. Truck for work applications will be provided.  \n\nEssential Job Responsibilities\n•\tAssist with wildlife operations as assigned  \n•\tFeed, monitor, check on wildlife and livestock\n•\tFill and maintain corn and protein feeders\n•\tAssist with wildlife surveys for deer and quail\n•\tScoring and aging white tailed deer on the hoof\n•\tScout and pattern white tailed deer\n•\tSet up hunting and blind locations as assigned\n•\tUtilize video equipment and cameras to capture wildlife and record data to ranch computers\n•\tGeneral post-harvest duties including skinning and cape preparation\n•\tAssist with maintenance and management of water systems\n•\tApplication of herbicides  for habitat management\n•\tMaintenance and upkeep of ranch equipment and facilities\n•\tHeavy equipment operation and maintenance (tractors, skid steers, backhoe’s)\n•\tFence construction, repair, and maintenance\n•\tAssist with any and other ranch activities as assigned by Wildlife or Ranch Manager \n•\tReports directly to Wildlife Manager with some oversight by Ranch Manager", "226": "Applicant will assist with daily herd check and maintenance of whitetail pens and hunting ranch, help with artificial insemination, and guided hunts.\nHousing provided", "264": "The Conservation Internship is for those interested in a \"hands-on\" experience in conservation and land management. This internship provides the perfect opportunity to build one's skills in sustainable land management, native species identification, and scientifically based data collection using geospatial and/or field research methods. Those interested in geographic information systems (GIS) techniques have the option to develop spatial modeling and map-making skills applicable to ongoing research projects and the needs of Westcave Preserve.\n\nThe candidate will have the opportunity to participate in several of the following research projects: endangered species habitat management, dragonfly migration monitoring, water quality testing, seasonal bird counts and surveys, and amphibian surveys. Routine duties of the internship will include assisting with general land management activities, trail maintenance, bird blind maintenance, and opening/closing the visitor center. Other duties will include non-native vegetation removal, conservation related research, and occasionally interacting with visitors at the visitor center or elsewhere on the preserve.\n\nWe encourage our interns to pursue their own passions in conservation as well, such as taking on a research project or implementing a program that would be sustainable and beneficial to the preserve.", "297": "Assist in daily operations of a 19,500 acre ranch in north central Texas.  Interns may be asked to help with wildlife, habitat, cattle, and fisheries management practices; painting; brush clearing; maintenance/repair/installation of hunting blinds; checking and filling feeders; facilities maintenance; land reclamation, small mammal trapping; construction; field cultivation; wildlife harvest and data collection; assisting hunters for dove, deer, and waterfowl; game cleaning; and other general ranch / cattle / wildlife work as needed.  Applicant must be able to lift 50 lbs and traverse across rough terrain.  Interns will assist with deer harvest management.  Interns who perform at a high level will have the opportunity to stay on with the ranch for a longer work period.  \n\nTerm:\t\tearly August 2021 to late December 2021 (negotiable)", "329": "Fall 2021 Bird Banding Apprenticeship \nSeptember 20th through to October 29th 2021\n\nThe Toucan Ridge Bird Observatory, located at the T.R.E.E.S Research Center in the Maya Mountains of Belize, currently has between 2 - 4 apprenticeship spots open for our Fall 2021 Bird Banding Apprenticeship Program. During this Apprenticeship you will learn how to set-up mist-nets, extract passerine birds from mist-nets, learn proper bird banding techniques, learn how to I.D., age and sex resident birds as well as Neotropical migrants, learn proper data entry, and more. In addition to the field work the Apprenticeship comes with 2 lectures on bird banding methodology as well as a lecture on Ageing and Sexing and hours of training. The main banding instructor is a North American Banding Council certified Trainer with over 20 years of experience in the field. You will also have the opportunity to work with other experienced banders and other apprentices from around the world. Apprentices will also have the opportunity to learn additional avian monitoring techniques, as well as methodologies to study other wildlife species, including turtle radio-telemetry and bat mist-netting.\n\nFees for the Apprenticeship: $364 US/week which includes all tutorship, access to all required equipment, all food (self-catering in communal kitchen but ingredients provided) and lodging at the research center in shared dormitory-style cabins with other same sex interns/apprentices/volunteers. Fees do not include airport transfer, flights, or travel medical insurance.  \n\nDates for the Apprenticeship: Interns can choose to do a minimum of 2 weeks to a maximum of 6 weeks during this Apprenticeship program, though 4 weeks is the recommended duration.\n\nSchedule: Banding runs every day Monday through Friday, from 5:30 am until 11:00 am. Apprentices are welcome to travel to visit other locations in Belize on weekends if they desire, however no refunds on food and lodging will be available if the apprentice decides to leave the station. \n\nHow to Apply: To register for our program please contact us at info@ecorana.ca\nand we will send you an application. For more information on our organization and facilities please visit our website: www.treesociety.org \n", "331": "High Roller Whitetails is looking for a highly motivated individual to join our team. This individual will get to work hands on with whitetail deer at one of the largest breeding operations in the state of Texas. The fall is one of our busiest times of the year with endless opportunities for learning. This would be a great internship for an individual seeking to become a veterinarian, working with wildlife, or anyone that is wanting to work in an animal industry. A few things that you would be required to participate in are the following:\n\nBottle Feeding \nWeaning\nVaccinating\nCutting Antlers\nAssist with general deer works\nArtificial insemination process \nEmbryo Process\nDay to day herd health \nDaily medication treatments\nCleaning daily\nHauling deer\n\n\nHousing is provided. Internship ends in December, but there are always opportunities to stay longer.", "345": "Role and Responsibilities:\n\nCritterfacts.com is a leader in sharing stories and information about wildlife and the environment to help inspire people to save the planet. We are currently looking for interns for the fall of 2021 to help build our wildlife archives. Accepted interns will perform the following tasks:\n\n•\tResearch information about wildlife based upon assigned category’s\n•\tCreate wildlife archive documents\n•\tIdentify images for each archive from approved images sources\n•\tUpload and format completed archives on Critterfacts.com\n\nLearning Objectives:\n\nDuring the internship you will learn how to do the following:\n\n•\tHow to identify and research reputable sources of information\n•\tHow to format wildlife archives documents\n•\tHow to use images properly with copyright \n•\tHow to format images using image software\n•\tHow to create web pages using templates\n\nWildlife Archive Categories:\n\nCurrently, we have several categories of wildlife included on Critterfacts.com. Based upon your entry and interests you can be assigned to one or more of the following categories:\n\n•\tMammals\n•\tAviary\n•\tInsects\n•\tSea Life\n•\tAmphibians\n•\tReptiles\n•\tEndangered\n•\tExtinct\n•\tDomesticated\n•\tPlants\n•\tOther", "408": "•\tTravel to various areas of Texas, working on properties that are under the direction of WSI.\n•\tGuiding – principally white-tailed deer.\n•\tSkinning, quartering, and caping of animals.\n•\tFeeder and blind maintenance.\n•\tFilling feeders.\n•\tCollecting harvest data.\n•\tShredding and tractor work.\n•\tShuttling of hunters to and from airport.\n•\tLimited office assistance.", "436": "Fawn Care Internship:\n\t\t\tIntern’s tasks will include but not be limited to: \n\t\t\tbottle raising whitetail fawns, feeding & caring for them\n\t\t\tsanitizing bottles, equipment & pens\n\t\t\tdaily monitoring of feed, pens & health\n\t\t\tfeed preparation\n\t\t\tcare of other livestock\n\nThis is a full time internship. We will be working 7 days a week, days off are few and far between. \n\nHousing will be provided in our facility on the ranch property.\nBringing a vehicle is not a requirement. \n\nThis is a lot of work but housing, meals, college credit and pay are offered. Salary:\t\t\t$750 per month starting pay", "450": "The Ingham Conservation District is seeking an intern to support the work of the Mid-Michigan Cooperative Invasive Species Management Area (CISMA) and the Smart Management of Microplastics in the Great Lakes project. The position will be maintained from June through August, 12-18 hours per week, during normal ICD business hours of Monday –Friday, 9:00 am – 3:00 pm with occasional evening and weekend hours for meetings and special events. \n\nJOB DUTIES\nThe Conservation Intern will assist the Invasive Species Coordinator and Ingham CD Executive Director with duties including the following:\n•\tPromote the Michigan Invasive Species Grant Program (MISGP)\n•\tPromote the Smart Management of Microplastic Pollution in the Great Lakes Project\n•\tCommunicate program information via social media\n•\tShare program information with the public at regional events\n•\tAssist with mailings of outreach materials \n•\tUtilize the Midwest Invasive Species Information Network reporting system\n•\tMaintain a Working List of Regional Invasive Species\n•\tParticipate in Invasive Species surveys \n•\tParticipate in invasive species removal events \n•\tAttend program meetings to gain expertise \n•\tAssist with other Conservation District activities and programs as needed\n\nCONDITIONS OF ANNOUNCEMENT - The Ingham Conservation District reserves the right to make changes to the content of this position announcement without notification and may at any time withdraw the announcement. \n\nEQUAL EMPLOYMENT OPPORTUNITY - Candidates will be considered without discrimination for any non-merit reason such as race, color, national origin, gender, religion, age, disability, political beliefs, sexual orientation, marital or familial status, or membership or non-membership in an employee organization.", "516": "Summer internship opportunity on 3400 acre commercial hunting and cattle ranch located in Tilden, TX. Duties will include habitat and brush management, wildlife surveys, predator control, and other ranch maintenance as needed to include but not limited to tree trimming, painting, fence repair,  plumbing, welding, mechanic work, etc. Applicants should have a basic knowledge of plant identification and general equipment operation, i.e. chainsaws, weed-eaters, four wheelers. Lodging and ranch vehicle will be provided. Applicants will email resumes to austin_schaefer@att.net.", "529": "The purpose of this position is to assist in pre-field assessments, preliminary research using current and historic images, and create maps as part of a multistage project or stand-alone visual aid.  \n\nIntern will create base maps and map packages including property boundary, general location, soil data, historic aerials, etc. Part of the job will be to establish gridline/point plot surveys for timber cruises as well as wetland and/or stream delineations. Person will also prepare detailed field assessments, reports, and mapping exhibits in the office and the field. \n\nThis position will primarily focus on computer, file, and data management; however, fieldwork participation will vary depending upon the project. Flexible working hours with task-based projects and independent time management with weekly progress reports and in-person meetings will be required. The applicant must have self-motivation and discipline.", "545": "Summer Public Programs Internship at the North Carolina Aquarium on Roanoke Island\n\nCollege students can explore their interests and gain practical work experience through an unpaid Public Programs education internship at the NC Aquarium on Roanoke Island. Summer Public Programs interns will gain skills in conducting education programs on a variety of marine and freshwater topics including sharks, sea turtles, snakes and more. Interns will be trained on handling live animals and how to effectively do presentations for the public with our animal ambassadors. Other areas in which interns will receive training include but are not limited to interpreting at our interactive touch pools, staffing discovery carts, interpreting during feeding presentations, and answering questions in various galleries.  \n\nInternships begin in late May with a relatively flexible start date and last for at least 10 weeks.  Possible evening, weekend and holiday work are required. You must be at least 18 years old to apply. Application materials for summer intern positions are due April 23rd.\n\nTo apply email a resume, cover letter and application (consolidate into one attachment, please only one attachment on email) \nApplication: https://assets.speakcdn.com/assets/2240/application_unpaid_internship.pdf\nContact: Cady Breslin\nEmail: cady.breslin@ncaquariums.com\n\n\nWebsite: \nhttp://www.ncaquariums.com/roanoke-island\n\nAbout Us:\nhttps://www.ncaquariums.com/roanoke-island-about-us \n\nTwitter:\n@NCAquarium_RI \n\nFacebook:\nhttps://www.facebook.com/NCAquariumRI/ \n\nWebsite:\nhttp://www.ncaquariums.com/roanoke-island-internships \n\nJob Perks:\nLearn how to deliver great education programs, gain skills for handling animal ambassadors, be a part of a great team and so much more!\n\nThis is an unpaid internship. Intern is responsible for securing housing.", "561": "Waneck Whitetails is a deer breeding facility in search of an intern that will help with raising bottle fawns, checking the deer and other general activities that concern the deer. \n\nResponsibilities include (but not limited to):\n-Bottle feeding fawns\n-Checking pens, waters and feeders. \n-Filling feeders and waters. \n-Helping to care for sick deer. \n-Alerting us to any possible sick deer\n-Tagging and tattooing the fawns\n-Cleaning barn/fawn boxes. \n-Vaccinating and giving oral medications to fawns \n\nThe intern selected will work with others that have experience in raising fawns and they will be there to help the intern throughout the summer. \nRoom and board are provided. Access to WiFi if needed (just please let us know if WiFi is needed).\nThis opportunity offers hands on experience and will provide insight to the deer breeding industry. \nTHIS WILL BE A FULL TIME, WHOLE SUMMER INTERNSHIP WITH LONG HOURS AND LIMITED TIME OFF.", "563": "In-Sync Exotics is verified by the Global Federation of Animal Sanctuaries and accredited by the American Sanctuary Association. We currently are home to over 75 exotic cats including lions, tigers, leopards, cougars, lynx, servals, ocelots and cheetahs. We offer 3-month and 6-month internships, designed to expand your knowledge in the care of exotic cats and the running of a sanctuary. \nExperience includes diet preparation, feeding, cleaning enclosures, enrichment, observation of medical care at our on-site clinic, record keeping, public education/tours, building new enclosures/general maintenance and more. Our interns work hard in all kinds of weather conditions, in a small close-knit team and learn a great deal about all aspects of exotic cat care. Our interns also enjoy learning through classes, research and field trips! \nLocated 45 minutes northeast of Dallas, interns get to enjoy exploring the DFW metroplex, it's lakes and surrounding areas on their 2-day weekend. \nCompensation: Onsite housing and a weekly stipend ($50/week)\n\nWe are currently accepting applications for the following terms: \nSummer: May 24, 2021 – August 14, 2021\nFall: August 30, 2021 – November 20, 2021\nInternships are minimum 12 weeks.\nResponsibilities\nInterns will experience a wide variety of tasks throughout the day. Beginning with pulling heavy boxes of meat to thaw, followed by cleaning outdoor and indoor exhibits, preparing diets, preparing and distributing enrichment, record keeping and grounds maintenance. \nAdditionally, interns will assist keepers in feeding and medication administration. \nThere are opportunities during the internship to learn more about veterinary care and behavioural training. A day’s work can be long hours especially in the case of an emergency. Work begins at 8am and sometimes doesn't finish until 6pm. Once a week interns will be required to carry out a night shift (7.30pm -11pm). The following day work would begin at 10am. A week is 5 days of work with a 2-day weekend. \n\n \nTo Apply please email Heather Lazek, one of our Intern Coordinators, at heatherlrt@gmail.com to request an application form.", "581": "Tagging bottle raising whitetail and mule deer fawns.\nCleaning and maintaining fawn facility.\nKeeping records on fawns.\nOnsite housing is provided", "617": "The Vashon-Maury Island Land Trust’s work permanently preserves and stewards land on Vashon and Maury Islands, in the heart of the Puget Sound. Our Stewardship program is largely comprised of on-site preserve management, habitat restoration, trail maintenance/new trail construction and invasive species removal. The position includes informal educational opportunities, wilderness first aid training, native plant identification, restoration design and citizen science data collection. This internship will also take us to the Elwha for a week to work with the Elwha tribe on their restoration work related to dam removal.  The Land Trust is currently seeking three seasonal interns to join our Stewardship crew from May 1 through October 2021.\n\nEssential Functions\n\nPreserve Stewardship\n•\tWork with crew members to accomplish a variety of stewardship actions including but not limited to habitat restoration, project maintenance, invasive weed removal, and tool maintenance.\n•\tConduct regular trail maintenance and assist with new trail construction, including but not limited to weed whacking, turnpike and bridge building, brush clearing.\n•\tFall planting of new restoration sites and/or supplemental planting in existing sites.\n•\tParticipate in volunteer work parties on preserves.\n•\tSmall construction projects, building kiosks, trail signs, and trail structures.\n•\tMaintenance of buildings and other infrastructure owned by The Vashon Land Trust. \n•\tRepresent Vashon Land Trust to preserve visitors, neighbors, and community members.", "626": "MCF seeks to fill several part-time volunteer summer internship positions to work out of our Ellensburg office and assist with field work in surrounding areas. Interns will collect data, assist with restoration, monitor vegetation, conduct education, and complete some office related tasks. We are seeking hard-working, dedicated individuals interested in building skills and experience in these areas. Each intern will be exposed to projects that will introduce them to and build upon their current skillset. Interns will have the opportunity to work on a variety of projects with MCF and partnering agencies. Below are descriptions of a few of the projects available this summer.\n\nPossible Activities:\n•\tNighttime rescue and relocation of bull trout that have been stranded in disconnected streams (this requires camping);\n•\tEducational outreach to recreationists to protect bull trout;\n•\tRemoving recreational dams that block access to bull trout and salmon spawning;\n•\tAquatic and terrestrial vegetation monitoring; \n•\tAquatic habitat surveys;\n•\tStewardship, including planting, weeding, and watering;\n•\tVegetation monitoring at floodplain and riparian restoration sites;\n•\tAssisting with fish population estimates;\n•\tRiver-based mapping of aquatic water stargrass on the lower Yakima River;\n•\tProviding youth environmental education/summer camp support;\n•\tAnd more!", "649": "The Absaroka-Beartooth Wilderness Foundation (ABWF) is seeking two (2) Wilderness Steward Interns for summer 2021. Each steward will work with U.S. Forest Service trail crews and ABWF staff and volunteers in the Custer-Gallatin National Forest’s Absaroka-Beartooth Wilderness. One position will be stationed in the Gardiner Ranger District in Gardiner, Montana; the other will be stationed in the Beartooth Ranger District in Red Lodge, Montana. Both will include backcountry hitches as long as 9 days at a time, requiring hikes with heavy packs as much as 12+ miles a day. \n\nQualified candidates will (a) come with strong backcountry experience, (b) be able to do hard work for long days in rugged conditions, (c) be self-sufficient and comfortable living in a remote environment, (d) have strong communication skills, both for visitor outreach and for working with team members and supervisors, and (e) be a cheerful and positive coworker and representative of the USFS and ABWF to wilderness visitors, volunteers, and partners. \n\nThe 16-week seasonal positions run from May 15-September 15, 2021. \n\nTo apply, email (a) cover letter, (b) resume, and (c) 3 references to Patrick Cross at pcross@abwilderness.org. Last day to apply is May 1, 2021, however, THIS JOB ANNOUNCEMENT WILL CLOSE AS SOON AS THE POSITIONS ARE FILLED!\n\nWork Duties include:\n(a) Manual labor on a variety of wilderness stewardship projects including trail maintenance, site restoration, and weed eradication.\n(b) Visitor contact and outreach work including education on wilderness ethics and regulations, and collecting visitor use monitoring data.\n(c) Logistical support of ABWF citizen science and volunteer engagement projects.\n(d) Positively representing the USFS and ABWF to a wide variety of wilderness visitors, volunteers, and community partners.\n\nAbout the ABWF and the Absaroka-Beartooth Wilderness:\nABWF is a non-profit organization dedicated to supporting stewardship of the Absaroka-Beartooth Wilderness and fostering appreciation of all wild lands. We work with the U.S. Forest Service supporting 'boots-on-the-ground' projects including volunteer engagement, education and outreach, and collaboration with a variety of community partners. Our annual internship program is one of the best ways we can support our USFS partners while also developing a strong cohort of professional wilderness stewards.\nThe Absaroka-Beartooth Wilderness of Montana and Wyoming is a 944,000 acre wilderness area nestled against the northern edge of Yellowstone National Park. One of the largest wilderness areas in the U.S. outside Alaska, it is characterized by rugged peaks over 12,000 feet in elevation (including the highest in Montana), alpine lakes, and broad expanses of tundra-covered plateaus above treeline. A diverse flora and fauna live here in abundance--grizzly bear, lynx, mountain goats, whitebark pine, and subalpine fir. Sixty trailheads lead to over 700 miles of trails in the A-B Wilderness alone. \nGardiner (pop. 500, elev. 5,000’) and Red Lodge (pop. 2,500; elev. 5,500’) both have vibrant summer tourism economies being gateway communities to Yellowstone National Park. They are a short drive to larger cities including Bozeman (pop. 40,000, 1.5 hours from Gardiner) and Billings (pop. 125,000, 1 hour from Red Lodge).\n\nThe ABWF is an equal opportunity provider dedicated to diversity, equity, and inclusion.", "674": "Under the direction of the Superintendent, this internship is an opportunity designed for students to obtain relevant work experience to be competitive for future positions in park operations, such as: management, interpretation/education, administration, maintenance, resource management and protection, law enforcement, etc.  Responsible for performing a complete range of tasks to experience all the aspects of park administration, operations and management.  Duties include, but are not limited to, natural and cultural resource management; facility, grounds and equipment maintenance management; interpretation and education programming and management; customer service, fee collection, revenue control and fiscal accountability; marketing and promotional programming; park patrols to include visitor contact and law enforcement observation.  Performs special projects/assignments and attends selected training programs to enhance the overall working knowledge and skills related to operational and management activities.  Internship will also include a special project to be mutually determined by supervisor and intern, to meet both site needs and intern’s educational and development. Performs additional duties as assigned.  Complies with all Agency, Division, and Branch rules, regulations, and procedures.\n\nNOTE:  As students, paid work experience reflected on your application may be limited.  Therefore, applicants are encouraged to include an addendum to their intern application that addresses any additional educational, volunteer, civic/community engagement or life experiences that addresses the knowledge, skills and abilities reflected on this intern opportunity.", "676": "Interested in gaining experience in fisheries? The Tiller Ranger District will be filling up to three Fisheries Internship positions. These positions are designed to introduce students to fisheries management on federal lands and provide work experience.  Fisheries internships include checking smolt traps, identification of salmonid and non-game species, measuring and marking of fish, stream surveys, snorkel counts, eDNA sampling and participating in several habitat restoration projects. \n\nStarting and ending dates are flexible, housing and a stipend ($30/working day) will be provided.\n\nInterested students should submit a letter of interest, resume and transcripts (unofficial okay) via email to Calib Baldwin calib.baldwin@usda.gov by March 26, 2021.", "687": "Brazos Valley Whitetails is looking for a hard working summer intern for 2021. We are a breeding facility of over 400 whitetail deer and several exotic species in Millsap, TX. \n\nInternship Job Duties will include but not be limited to:\n\n-Daily feeding of deer\n-Fawn tagging and upkeep of new fawn records\n-Bottle feeding fawns\n-Learning immobilization techniques used for animals \n-Learning signs of overall animal condition and health\n-Cleaning and sanitation of all deer handling facilities\n-Mowing, weed eating, shredding, and general house work\n-General Ranch maintenance \n\nThe internship will most likely lead into the fall breeding season where the intern will be hands on with Artificial Insemination, Embryo Transfers, IVF, semen collection of breeder bucks, movement of stocker bucks, and removal of buck antlers.", "688": "Los Grandotes Whitetails has been breeding whitetail deer for many years and are in search for an individual interested in pursuing a career in the wildlife field for the summer. Responsibilities and duties include but not are limited to:\n\n- Assisting daily inspection of deer in the deer breeding pens\n- Assisting in diagnosing and medicating sick/injured deer\n- Assisting in daily bottle feeding/raising of whitetail deer fawns multiple times a day\n- Assisting in general maintenance of deer pens and deer breeding facilities\n\nThe individual selected for the position with work along side of multiple, seasoned individuals who are willing to share their knowledge about whitetail deer and the deer breeding industry. Room and board will be provided to the individual selected here on the ranch. We have vehicles for the individual to use on the ranch for ranch purposes. This is a great opportunity to gain hands-on experience with wildlife and get started in the deer breeding industry.", "718": "- Assists with aquatic field sampling on the Missouri River and its tributaries\n- Uses benthic trawling, boat-mounted electrofishing, trap nets, and other gears to capture age-0 sturgeon and assess fish communities within the mainstem Missouri River and select tributaries\n- Performs identification of big river fishes in field and lab settings\n- Collects fish tissue for age determination, genetic identification, and fish health sampling\n- Assists Science and Regional Resource Management staff with projects related to protection of aquatic communities, management of sportfish populations, and nuisance or invasive species", "756": "Aquatic Ecosystem Consultants, LLC (AEC) is a full-service pond and lake management company serving Kansas, Missouri, Iowa, and Nebraska. We offer a multitude of services including aquatic weed and algae control, fish stocking, fountain, and aeration system installation, and water quality monitoring. \n\nOur internship position (based out of Bonner Springs, Kansas) is a paid position. The intern will travel daily to multiple job sites to assist with the scheduled work. The summer work is mostly carried out with the use of a boat and spray application equipment. The work schedule will involve overnight travel.  Lodging costs and meal expenses for overnight stays will be covered by AEC.  \n\nThroughout the summer, the intern will learn application techniques, aquatic plant and algae identification, and water quality monitoring procedures.  Interns will learn general maintenance procedures on fountains, aeration systems, trucks, boats, and AEC property.  Data entry and record-keeping will be part of the entry-level position.  The position has multiple season availability and full-time employment possibilities.", "787": "Klamath Bird Observatory (www.klamathbird.org) is seeking to fill a volunteer intern position in our Oregon Vesper Sparrow demography research program, from ~May 3 - June 30, 2021 (exact dates TBD). We are contributing to a range-wide study to understand causes of decline in this imperiled subspecies. Primary duties will include nest-searching and monitoring, color band resighting, and vegetation surveys in meadows of the western Cascades, and associated data entry based out of our office in Ashland, Oregon.\n\nEXPECTATIONS: The intern will work with the field technician to conduct nest-searching and monitoring, color band resighting, vegetation surveys, and data entry. Previous experience in avian field research and ability to see full range of colors are required. Training in specific field protocols will be provided. Ability to use your own vehicle (typically on paved or improved dirt roads; 4WD is not necessary) and willingness to camp for the duration of the field season are required. We can provide suggestions for free rustic camping options near field sites.\n\nCOMPENSATION: The volunteer intern will receive a stipend of $750/mo., and should expect to work about 8 hours/day, not to exceed 40 hours/week. Transportation to Ashland, OR, and personal field gear (e.g. tent, camping gear, hiking boots) are the responsibility of the applicant. Applicants must have a car, valid driver’s license, current insurance, and be able to provide their driving record if needed. Use of a personal vehicle for work purposes will be required, and the intern will be reimbursed for mileage at $0.56/mile.", "826": "Still Waters Ranch, located in Bulverde just 10 minutes from San Antonio, Texas, is now accepting resumes from college students that would like an opportunity to work on a whitetail deer and cattle breeding operation for summer 2021. Intern will be exposed to all aspects of raising deer with the primary responsibilities to care for the fawns. This includes administering medications, tagging, feeding, record keeping, sterilization, and basic maintenance of facilities. You will also be involved in a variety of ranch related activities. Monitoring and managing pasture buck operations  to maximize hunter opportunities. We operate a Brangus and Wagyu cow calf operation and we will be working cattle including medicating, halter training, inseminating and transferring embryos as well as feeding and caring for the animals. General ranch work including exercising the horses, fence building and repair, feral hog control and brush work will also be involved. You will be exposed to some basic skills like welding and metal work, bobcat operation, and tractor work as well. Candidate must be motivated, patient, have good observational skills and be a dependable good person.\nYou should be enrolled in a college major related to this activity, have a good performance record and completed two years of college work.\nStarting and ending dates will be late May through early August or late July.\nVery nice private housing provided with full kitchen facilities. Work schedule is about 8 to 10 hours daily with off days generally every other weekend or with other agreed arrangements. Longer hours and odd work schedules possible if needed to care for the animals. \nThis is our tenth year of this internship program and we will gladly provide you the names and contact info for previous interns.\nPay is $250 per week with a potential bonus at end of assignment depending upon performance.  \nQuestions?? Call 210-722-4472.", "837": "Interns assist with the care of oysters and maintenance of upweller tank located on Hyannis Harbor. In addition, interns will be involved with water quality and marine invasive species monitoring programs at several locations in the town of Barnstable. \n\nDuties include, but are not limited to: \n•\tAssist with the daily care of oysters at off-site upweller tank on Hyannis Harbor.\n•\tSort and track growth of oysters.\n•\tClean and maintain upweller and equipment.\n•\tCollect and analyze water samples from upweller and harbor.\n•\tData entry and processing of oyster and water quality data in Excel. \n•\tAssist with community outreach and education on oysters and water quality.\n•\tAssist with other water sampling programs and marine invasive species monitoring.\n•\tAssist BCWC staff with other duties as needed.", "846": "Location: Cross Plains, TX\n\nMossy Rock Whitetails and Exotics is looking for a motivated and hardworking undergraduate or graduate student to help with the day to day duties of a whitetail breeding facility and ranch work. \nDuties of this position include but are not limited to:\n•\tAssist in the daily feedings of pen deer\n•\tAssist in tagging, record keeping, and possible bottle raising of fawns\n•\tAssist in treating sickness and injury of adults and fawns\n•\tMowing and shredding pens and pasture\n•\tFilling corn feeders\n•\tPen maintenance (hanging fawn wire, fixing gates/fences)\n•\tGeneral cleaning of facilities and vehicles\nSalary: $1,200/month\nHousing: Housing will be provided on site. No pets allowed.", "874": "Location : Franklin, TX \nSalary: Room and $200.00 food stipend per month plus an end of the year summer bonus and /or  full time offer.\n\nStart Date: To start in May and actual date can be discussed based on school schedule\nLast date to Apply: Until Filled. M3 Whitetails is looking for 4-6 motivated undergraduate or graduate students to assist us in our 2021 summer internship program. This job will provide you with hands on experience in many aspects of a whitetail deer breeding operation. We are located between Hearne, Texas and Franklin, Texas. The duties of this position include but are not limited to: \n•\tCare of fawns (including tagging, monitoring health conditions, and bottle-feeding)\n•\tRecording data for each fawn born \n•\tMedical Treatment of Adult and Fawns\n•\tParticipating on surgical procedures\n•\tFeeding the adult whitetail herd and exotic animals \n•\tMaintenance of water system throughout the deer pens \n•\tMaintenance of fences, gates and pens\n•\tMaintaining a clean working facility\n\nWe are also looking for someone is interested and has experience in Animal Photography and editing. There is a very strong desire for this photography person become full time and assist and/or take over marketing and assiting head salesman with sales and follow ups. \n\nHere is  snapshot of our 2020 summer interns\n\nhttps://vimeo.com/495323824\n\nPlease email a cover letter and resume and summer availbilty dates to joey@m3whitetails.com", "880": "This position is hosted by the US Fish and Wildlife Service at the Willamette Valley National Wildlife Refuge in Corvallis, Oregon. The intern must have field experience and be able to work in a shrub landscape in hot temperatures. Early mornings are required to conduct nest searches and monitoring of Streaked Horned Larks.\n\nThe position offers:\n\n- housing\n- weekly stipend of $400\n- lodging\n- travel expenses", "899": "On Wednesday, Jan. 26, from 12 to 3 p.m. ET, the Oak Ridge Institute for Science and Education (ORISE) is hosting a virtual career fair to highlight the variety of paid internships, fellowships and research opportunities available within our Research Participation Programs.\n\nDuring the event, you’ll have the opportunity to:\n\nCHAT with ORISE representatives and mentors from a variety of programs and federal agencies across all of ORISE.\n\nLEARN about the research and/or projects conducted within those programs.\n\nEXPLORE paid internships, fellowships, and research opportunities.\n\nCONNECT with ORISE staff members for questions about applying, what to expect during the program, and to learn more about the ORISE experience. ", "927": "Summary:\n\nAmerican Conservation Experience (ACE), a nonprofit Conservation Corps, in partnership with the Bureau of Reclamation, Denver, Colorado, is seeking ONE Procurement Support Member for 26 weeks to assist in tasks related to the management of the Department of the Treasury's Automated Standard Application for Payment (ASAP) system and other tasks related to Federal grants management.\n\nThis opportunity is intended for enthusiastic professionals from all educational backgrounds. This is an opportunity for someone with an interest in learning about the Federal grant award process from the Federal perspective, as well as getting hands-on experience with the system used for Federal grant fund distribution.\n\nStart Date:  Late January/February 2021\n\nEnd Date:  June 2021 (possibility to extend depending on funding available)\n\nPosition Description:\n\nThis position will serve as the Bureau of Reclamation's primary contact for the ASAP enrollment process. ASAP is used by Federal agencies to provide grant recipients with access to Federal funds awarded through a Federal grant. \n\nThe duties of this position will include:\n\n- Directly communicating with grant award recipients and providing guidance on the ASAP enrollment process.\n- Receiving ASAP enrollment forms.\n- Initiating enrollment within ASAP and tracking the recipient's progress.\n- Processing recipient payment requests and coordinating with grant management staff as appropriate.\n- Additional duties may be assigned depending on interest and ability which could include running various reports and monitoring compliance.\n\nTraining:\n\nTraining will include on the job training provided by a team member. That team member will serve as the day-to-day contact for the position and will be available to provide assistance or support as needed.", "1459": "For employment and internship opportunities, please submit your resume, cover letter and compensation requirements to:\n\nTNT Environmental, Inc.\nAttn: Human Resources\n4455 Brookfield Corporate Drive\nSuite 100\nChantilly, Virginia 20151\n\nEmail: Info@TNTenvironmentalinc.com\nPhone: 703-466-5123\nTNT is seeking an Environmental Scientist with 3-5 years of relevant experience for its Chantilly, Virginia office. Qualified candidates should have a degree in Biology, Ecology, Botany, or Environmental Science, well developed written and oral communication skills and a desire to work in a team-oriented environment. The position will entail a mixture of office and field work in all seasons of the year.\n\nThe primary responsibilities of the position are to conduct and manage routine to complex wetland and natural resource projects, work closely with a team of wetland and natural resource professionals and business development. Fundamental and working knowledge of local, state and federal regulatory regulations and processes in Virginia, Maryland, DC and West Virginia is critical."}, "company_name": {"105": "In-Sync Exotics", "52": "Snowdon Wildlife Sanctuary", "363": "Blue Creek Whitetails", "825": "Fossil Rim Wildlife Center", "879": "Tres Bahias Rod and Gun Club", "1050": "Conservation Corps New Mexico", "1457": "1 Degree - 11th Hour Racing Team", "1498": "US Forest Service", "1758": "Paradise Nursery", "1760": "Wilde Oaks Nursery, Inc.", "56": "Canyonlands Field Institute", "58": "The Wildlife Center at Legends Ranch", "73": "Might Textile Inc", "76": "Intern Africa", "115": "Student Conservation Association/ U.S. Forest Service", "187": "conservation corps new mexico", "194": "Blue Creek Whitetails", "197": "Sweden Ranch LP", "226": "Woodard whitetails of Kentucky", "264": "Westcave Preserve", "297": "MT7 Ranch", "329": "Toucan Ridge Ecology and Education Society", "331": "High Roller Whitetails", "345": "CritterFacts Global, LLC", "408": "Wildlife Systems", "436": "KDH Whitetail Nursery", "450": "Ingham Conservation District", "516": "Rancho Tres Hijos", "529": "Conservation Equity Partners", "545": "North Carolina Aquarium on Roanoke Island", "561": "Waneck Whitetails", "563": "In-Sync Exotics", "581": "Pogue Whitetails", "617": "Vashon-Maury Island Land Trust", "626": "Mid-Columbia Fisheries Enhancement Group", "649": "Absaroka-Beartooth Wilderness Foundation", "674": "Texas Parks & Wildlife Department", "676": "US Forest Service, Tiller Ranger District, Umpqua National Forest", "687": "Brazos Valley Whitetails", "688": "Los Grandotes Whitetails", "718": "Missouri Department of Conservation", "756": "Aquatic Ecosystem Consultants, LLC", "787": "Klamath Bird Observatory", "826": "Still Waters Ranch", "837": "Barnstable Clean Water Coalition", "846": "Mossy Rock Whitetails & Exotics", "874": "M3 Whitetails", "880": "US Fish & Wildlife Service", "899": "Oak Ridge Institute for Science and Education (ORISE)", "927": "American Conservation Experience", "1459": "TNT Environmental"}, "company_location": {"105": "Wylie, TX", "52": "McCall, ID", "363": "Falfurrias, TX", "825": "Glen Rose, TX", "879": "Port Lavaca, TX", "1050": "Las Cruces, NM", "1457": "Fremont, CA", "1498": "Minneapolis, MN", "1758": "Los Angeles, CA", "1760": "Raleigh, NC", "56": "Moab, UT", "58": "Ely, MN", "73": "Austin, TX", "76": "South San Francisco, CA", "115": "New Waverly, TX", "187": "New York, NY", "194": "Falfurrias, TX", "197": "Benavides, TX", "226": "Glasgow, KY", "264": "Round Mountain, TX", "297": "East Los Angeles, CA", "329": "Mont Belvieu, TX", "331": "Center, TX", "345": "Fremont, CA", "408": "San Angelo, TX", "436": "Robstown, TX", "450": "Mason, MI", "516": "Tilden, TX", "529": "Nacogdoches, TX", "545": "North Charleston, SC", "561": "Corpus Christi, TX", "563": "Wylie, TX", "581": "Bellville, TX", "617": "Vashon, WA", "626": "Ellensburg, WA", "649": "Montana City, MT", "674": "Rockport, TX", "676": "Oregon, IL", "687": "Millsap, TX", "688": "Sonora, TX", "718": "Columbia, SC", "756": "Bonner Springs, KS", "787": "Oregon, OH", "826": "Bulverde, TX", "837": "Somerville, MA", "846": "Cross Plains, TX", "874": "Franklin, TX", "880": "Corvallis, OR", "899": "Viroqua, WI", "927": "Indianapolis, IN", "1459": "Chantilly, VA"}, "source": {"105": "tamu", "52": "tamu", "363": "tamu", "825": "tamu", "879": "tamu", "1050": "tamu", "1457": "indeed", "1498": "indeed", "1758": "indeed", "1760": "indeed", "56": "tamu", "58": "tamu", "73": "tamu", "76": "tamu", "115": "tamu", "187": "tamu", "194": "tamu", "197": "tamu", "226": "tamu", "264": "tamu", "297": "tamu", "329": "tamu", "331": "tamu", "345": "tamu", "408": "tamu", "436": "tamu", "450": "tamu", "516": "tamu", "529": "tamu", "545": "tamu", "561": "tamu", "563": "tamu", "581": "tamu", "617": "tamu", "626": "tamu", "649": "tamu", "674": "tamu", "676": "tamu", "687": "tamu", "688": "tamu", "718": "tamu", "756": "tamu", "787": "tamu", "826": "tamu", "837": "tamu", "846": "tamu", "874": "tamu", "880": "tamu", "899": "tamu", "927": "tamu", "1459": "indeed"}, "job_link": {"105": "https://wfscjobs.tamu.edu/jobs/exotic-cat-sanctuary-internship-wylie-texas/", "52": "https://wfscjobs.tamu.edu/jobs/winter-caretaker-mccall-id/", "363": "https://wfscjobs.tamu.edu/jobs/whitetail-bottle-feeding-internship-texas-2/", "825": "https://wfscjobs.tamu.edu/jobs/prairie-grouse-conservation-internship-texas-2/", "879": "https://wfscjobs.tamu.edu/jobs/coastal-wildlife-internship-summer-texas-2/", "1050": "https://wfscjobs.tamu.edu/jobs/organ-mountains-las-cruces-district-office-outdoor-recreation-planner-las-cruces-nm/", "1457": "https://www.indeed.com/company/1-Degree---11th-Hour-Racing-Team/jobs/Sustainability-Toolbox-Community-Manager-fc04d93f6cf209f9?fccid=0d4dec3fafbc2760&vjs=3", "1498": "https://www.indeed.com/company/United-States-Forest-Service/jobs/Information-Assistant-2d715cd54780bd34?fccid=421e1914938b668b&vjs=3", "1758": "https://www.indeed.com/company/Paradise-Nursery/jobs/Plant-Nursery-Associate-f46061dbc38c01fe?fccid=278da5299bfdd299&vjs=3", "1760": "https://www.indeed.com/company/Wilde-Oaks-Nursery,-Inc./jobs/Greenhouse-Assistant-518612f7264620fe?fccid=4391add54f55d534&vjs=3", "56": "https://wfscjobs.tamu.edu/jobs/americorps-vista-bipoc-program-development-member/", "58": "https://wfscjobs.tamu.edu/jobs/the-wildlife-center-at-legends-ranch-internship/", "73": "https://wfscjobs.tamu.edu/jobs/administrative-accounting-assistant-texas/", "76": "https://wfscjobs.tamu.edu/jobs/veterinarian-programme-south-africa-wildlife-large-and-small-animals/", "115": "https://wfscjobs.tamu.edu/jobs/integrated-fire-and-recreation-intern-texas/", "187": "https://wfscjobs.tamu.edu/jobs/public-affairs-specialist-new-mexico/", "194": "https://wfscjobs.tamu.edu/jobs/whitetail-herd-health-intern-texas/", "197": "https://wfscjobs.tamu.edu/jobs/wildlife-internship-sweden-ranch-benavides-tx/", "226": "https://wfscjobs.tamu.edu/jobs/whitetail-deer-ranch-intern-kentucky/", "264": "https://wfscjobs.tamu.edu/jobs/conservation-internship-westcave-preserve-in-round-mountain-texas/", "297": "https://wfscjobs.tamu.edu/jobs/ranch-wildlife-management-fall-internship-mt-7-ranch/", "329": "https://wfscjobs.tamu.edu/jobs/bird-banding-apprenticeship-belize/", "331": "https://wfscjobs.tamu.edu/jobs/fall-deer-breeding-internship/", "345": "https://wfscjobs.tamu.edu/jobs/wildlife-publishing-intern-fall-2021-remote/", "408": "https://wfscjobs.tamu.edu/jobs/wildlife-systems-intern-texas/", "436": "https://wfscjobs.tamu.edu/jobs/whitetail-nursery-intern-texas/", "450": "https://wfscjobs.tamu.edu/jobs/conservation-intern-mason-mi/", "516": "https://wfscjobs.tamu.edu/jobs/wildlife-internship-tilden-tx/", "529": "https://wfscjobs.tamu.edu/jobs/gis-internship-texas/", "545": "https://wfscjobs.tamu.edu/jobs/summer-public-programs-internship-manteo-nc/", "561": "https://wfscjobs.tamu.edu/jobs/fawn-raising-summer-internship-in-texas/", "563": "https://wfscjobs.tamu.edu/jobs/large-cat-internship-in-sync-exotics-texas/", "581": "https://wfscjobs.tamu.edu/jobs/internship-at-deer-breeding-facility/", "617": "https://wfscjobs.tamu.edu/jobs/land-conservation-internship-vashon-island-washington/", "626": "https://wfscjobs.tamu.edu/jobs/summer-intern-washington/", "649": "https://wfscjobs.tamu.edu/jobs/wilderness-steward-internship-absaroka-beartooth-wilderness-montana/", "674": "https://wfscjobs.tamu.edu/jobs/goose-island-state-park-summer-2021-internship-rockport-texas/", "676": "https://wfscjobs.tamu.edu/jobs/fisheries-internship-tiller-oregon/", "687": "https://wfscjobs.tamu.edu/jobs/whitetail-breeding-internship-millsap-tx/", "688": "https://wfscjobs.tamu.edu/jobs/fawning-and-deer-breeding-internship-sonora-tx/", "718": "https://wfscjobs.tamu.edu/jobs/big-rivers-intern-paid-missouri/", "756": "https://wfscjobs.tamu.edu/jobs/lake-and-pond-technician-kansas-missouri-2/", "787": "https://wfscjobs.tamu.edu/jobs/nest-searching-intern-1-southwestern-oregon/", "826": "https://wfscjobs.tamu.edu/jobs/san-antonio-deer-cattle-internship-bulverde-texas/", "837": "https://wfscjobs.tamu.edu/jobs/aquaculture-water-quality-internships-cape-cod-ma/", "846": "https://wfscjobs.tamu.edu/jobs/summer-whitetail-breeding-internship-in-texas/", "874": "https://wfscjobs.tamu.edu/jobs/m3-whitetails-summer-internship-texas/", "880": "https://wfscjobs.tamu.edu/jobs/streaked-horned-lark-field-assistant-corvallis-oregon/", "899": "https://wfscjobs.tamu.edu/jobs/experience-orise-virtual-career-fair-stem-policy-and-technical-internships-and-fellowships-virtual/", "927": "https://wfscjobs.tamu.edu/jobs/ace-procurement-and-administration-support-member-denver-co-the-position-will-be-remote-until-in-person-work-is-determined-allowable-by-senior-leadership/", "1459": "https://www.indeed.com/rc/clk?jk=d77583df76ada449&fccid=24f6562f4e7b82ea&vjs=3"}}}